<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Clojure,Clojure For The Branve And True," />





  <link rel="alternate" href="/atom.xml" title="胡军的网络日志" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x672C;&amp;#x6587;&amp;#x662F;&amp;#x6211;&amp;#x5BF9;Clojure&amp;#x4E66;&amp;#x7C4D; CLOJURE FOR THE BRAVE AND TRUE&amp;#x7B2C;&amp;#x5341;&amp;#x4E00;&amp;#x7AE0;Mastering Concurrent Processes with core.async &amp;#x505A;&amp;#x7684;&amp;#x7FFB;&amp;#x">
<meta property="og:type" content="article">
<meta property="og:title" content="【译】Brave Clojure 第十一章:用core.async掌握并发过程">
<meta property="og:url" content="http://yoursite.com/2016/08/02/brave-clojure-core-async/index.html">
<meta property="og:site_name" content="胡军的网络日志">
<meta property="og:description" content="&amp;#x672C;&amp;#x6587;&amp;#x662F;&amp;#x6211;&amp;#x5BF9;Clojure&amp;#x4E66;&amp;#x7C4D; CLOJURE FOR THE BRAVE AND TRUE&amp;#x7B2C;&amp;#x5341;&amp;#x4E00;&amp;#x7AE0;Mastering Concurrent Processes with core.async &amp;#x505A;&amp;#x7684;&amp;#x7FFB;&amp;#x">
<meta property="og:image" content="http://yoursite.com/2016/08/02/brave-clojure-core-async/hotdog-vending-machine.png">
<meta property="og:updated_time" content="2016-08-04T13:55:33.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="【译】Brave Clojure 第十一章:用core.async掌握并发过程">
<meta name="twitter:description" content="&amp;#x672C;&amp;#x6587;&amp;#x662F;&amp;#x6211;&amp;#x5BF9;Clojure&amp;#x4E66;&amp;#x7C4D; CLOJURE FOR THE BRAVE AND TRUE&amp;#x7B2C;&amp;#x5341;&amp;#x4E00;&amp;#x7AE0;Mastering Concurrent Processes with core.async &amp;#x505A;&amp;#x7684;&amp;#x7FFB;&amp;#x">
<meta name="twitter:image" content="http://yoursite.com/2016/08/02/brave-clojure-core-async/hotdog-vending-machine.png">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"right","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 【译】Brave Clojure 第十一章:用core.async掌握并发过程 | 胡军的网络日志 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-right page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">胡军的网络日志</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">pursue next update</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                【译】Brave Clojure 第十一章:用core.async掌握并发过程
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-08-02T22:11:30+08:00" content="2016-08-02">
              2016-08-02
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/08/02/brave-clojure-core-async/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/08/02/brave-clojure-core-async/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x672C;&#x6587;&#x662F;&#x6211;&#x5BF9;Clojure&#x4E66;&#x7C4D; <a href="http://www.braveclojure.com/clojure-for-the-brave-and-true/" target="_blank" rel="external">CLOJURE FOR THE BRAVE AND TRUE</a>&#x7B2C;&#x5341;&#x4E00;&#x7AE0;<a href="http://www.braveclojure.com/core-async/" target="_blank" rel="external">Mastering Concurrent Processes with core.async</a> &#x505A;&#x7684;&#x7FFB;&#x8BD1;&#x3002;&#x7FFB;&#x8BD1;&#x5F62;&#x5F0F;&#xFF0C;&#x4E2D;&#x82F1;&#x5BF9;&#x7167;&#xFF0C;&#x82F1;&#x6587;&#x5F15;&#x7528;&#x8DDF;&#x7740;&#x4E2D;&#x6587;&#x7FFB;&#x8BD1;&#x3002;&#x5982;&#x6709;&#x9519;&#x8BEF;&#xFF0C;&#x5728;&#x6240;&#x96BE;&#x514D;&#xFF0C;&#x6B22;&#x8FCE;&#x6307;&#x6B63;&#x3002;</p>
<p><a href="https://morrxy.github.io/tags/Clojure-For-The-Branve-And-True/" target="_blank" rel="external">&#x5176;&#x4ED6;&#x7AE0;&#x7684;&#x7FFB;&#x8BD1;&#x5728;&#x8FD9;&#x91CC;</a></p>
<p>&#x8BD1;&#x6587;&#x5F00;&#x59CB;&#x3002;</p>
<hr>
<blockquote>
<p>One day, while you are walking down the street, you will be surprised, intrigued, and a little disgusted to discover a hot dog vending machine. Your scalp tingling with guilty curiosity, you won&#x2019;t be able to help yourself from pulling out three dollars and seeing if this contraption actually works. After accepting your money with a click and a whir, it pops out a fresh hot dog, bun and all.</p>
</blockquote>
<p>&#x6709;&#x4E00;&#x5929;&#x4F60;&#x5728;&#x8857;&#x4E0A;&#x770B;&#x89C1;&#x4E00;&#x4E2A;&#x70ED;&#x72D7;&#x8D29;&#x5356;&#x673A;&#x3002;</p>
<p><img src="/2016/08/02/brave-clojure-core-async/hotdog-vending-machine.png" alt="hotdog-vending-machine"></p>
<blockquote>
<p>The vending machine exhibits simple behavior: when it receives money, it releases a hot dog and then gets ready for the next purchase. When it&#x2019;s out of hot dogs, it stops. All around us are hot dog vending machines in different guises&#x2014;independent entities concurrently responding to events in the world. The espresso machine at your favorite coffee shop, the pet hamster you loved as a child&#x2014;everything can be deconstructed into a set of behaviors that follow the general form &#x201C;when x happens, do y.&#x201D; Even the programs we write are just glorified hot dog vending machines, each one an independent process waiting for the next event, whether it&#x2019;s a keystroke, a timeout, or the arrival of data on a socket.</p>
</blockquote>
<p>&#x8D29;&#x5356;&#x673A;&#x7684;&#x884C;&#x4E3A;&#x5F88;&#x7B80;&#x5355;:&#x6536;&#x94B1;&#xFF0C;&#x653E;&#x51FA;&#x4E00;&#x4E2A;&#x70ED;&#x72D7;&#xFF0C;&#x7B49;&#x5F85;&#x4E0B;&#x6B21;&#x8D2D;&#x4E70;&#x3002;&#x70ED;&#x72D7;&#x5356;&#x5B8C;&#x4E86;&#xFF0C;&#x5C31;&#x505C;&#x6B62;&#x5DE5;&#x4F5C;&#x3002;&#x6211;&#x4EEC;&#x5468;&#x56F4;&#x5230;&#x5904;&#x90FD;&#x662F;&#x4F2A;&#x88C5;&#x7684;&#x70ED;&#x72D7;&#x8D29;&#x5356;&#x673A;-&#x5BF9;&#x4E8B;&#x4EF6;&#x5E76;&#x53D1;&#x54CD;&#x5E94;&#x7684;&#x5B9E;&#x4F53;&#x3002;&#x5496;&#x5561;&#x5E97;&#x7684;&#x5496;&#x5561;&#x673A;&#xFF0C;&#x5BA0;&#x7269;&#x4ED3;&#x9F20;-&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x80FD;&#x5206;&#x89E3;&#x4E3A;&#x4E00;&#x7EC4;&#x9075;&#x5FAA;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x5F62;&#x5F0F;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x8FD9;&#x4E2A;&#x5F62;&#x5F0F;&#x5C31;&#x662F;&#x201C;&#x5F53;x&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x505A;y&#x201D;&#x3002;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x53EA;&#x662F;&#x70ED;&#x72D7;&#x8D29;&#x5356;&#x673A;&#xFF0C;&#x4F46;&#x6BCF;&#x4E2A;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x6B63;&#x5728;&#x7B49;&#x5F85;&#x4E0B;&#x6B21;&#x4E8B;&#x4EF6;&#x7684;&#x72EC;&#x7ACB;&#x8FC7;&#x7A0B;&#xFF0C;&#x65E0;&#x8BBA;&#x4E8B;&#x4EF6;&#x662F;&#x6309;&#x952E;&#xFF0C;&#x8D85;&#x65F6;&#xFF0C;&#x6216;socket&#x4E0A;&#x7684;&#x6570;&#x636E;&#x5230;&#x8FBE;&#x3002;</p>
<blockquote>
<p>Clojure&#x2019;s core.async library allows you to create multiple independent processes within a single program. This chapter describes a useful model for thinking about this style of programming as well as the practical details you need to know to actually write code. You&#x2019;ll learn how to use channels to communicate between independent processes created by go blocks and <code>thread</code>; a bit about how Clojure manages threads efficiently with parking and blocking; how to use <code>alts!!</code>; and a more straight&#xAD;forward way of creating queues. Finally, you&#x2019;ll learn how to kick callbacks in the butt with process pipelines.</p>
</blockquote>
<p>Clojure&#x7684;core.async&#x5E93;&#x8BA9;&#x4F60;&#x80FD;&#x5728;&#x5355;&#x4E00;&#x7A0B;&#x5E8F;&#x91CC;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x7AE0;&#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x4E8E;&#x601D;&#x8003;&#x8FD9;&#x79CD;&#x98CE;&#x683C;&#x7684;&#x7F16;&#x7A0B;&#x6709;&#x7528;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x4E5F;&#x63CF;&#x8FF0;&#x4E86;&#x5199;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x4F60;&#x5C06;&#x5B66;&#x4E60;&#xFF1A;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x901A;&#x9053;(channel)&#x5728;go&#x4EE3;&#x7801;&#x5757;(go blocks)&#x6216;<code>thread</code>&#x521B;&#x5EFA;&#x7684;&#x72EC;&#x7ACB;&#x8FC7;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#xFF1B;Clojure&#x5982;&#x4F55;&#x7528;&#x505C;&#x6CCA;(parking)&#x548C;&#x963B;&#x585E;(blocking)&#x6709;&#x6548;&#x7BA1;&#x7406;&#x7EBF;&#x7A0B;&#xFF1B;&#x5982;&#x4F55;&#x4F7F;&#x7528;<code>alts!!</code>&#xFF1B;&#x7528;&#x66F4;&#x76F4;&#x63A5;&#x65B9;&#x6CD5;&#x521B;&#x5EFA;&#x961F;&#x5217;&#xFF1B;&#x5982;&#x4F55;&#x7528;&#x8FC7;&#x7A0B;&#x7BA1;&#x9053;&#x5E72;&#x6389;&#x56DE;&#x8C03;&#x3002;</p>
<blockquote>
<p>Getting Started with Processes</p>
</blockquote>
<h2 id="&#x4ECE;&#x8FC7;&#x7A0B;&#x5F00;&#x59CB;"><a href="#&#x4ECE;&#x8FC7;&#x7A0B;&#x5F00;&#x59CB;" class="headerlink" title="&#x4ECE;&#x8FC7;&#x7A0B;&#x5F00;&#x59CB;"></a>&#x4ECE;&#x8FC7;&#x7A0B;&#x5F00;&#x59CB;</h2><blockquote>
<p>At the heart of core.async is the process, a concurrently running unit of logic that responds to events. The process corresponds to our mental model of the real world: entities interact with and respond to each other independently without some kind of central control mechanism pulling the strings. You put your money in the machine, and out comes a hot dog, all without the Illuminati or Big Brother orchestrating the whole thing. This differs from the view of concurrency you&#x2019;ve been exploring so far, where you&#x2019;ve defined tasks that are either mere extensions of the main thread of control (for example, achieving data parallelism with <code>pmap</code>) or tasks that you have no interest in communicating with (like one-off tasks created with <code>future</code>).</p>
</blockquote>
<p>core.async&#x7684;&#x6838;&#x5FC3;&#x662F;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E76;&#x53D1;&#x8FD0;&#x884C;&#x7684;&#xFF0C;&#x5BF9;&#x4E8B;&#x4EF6;&#x505A;&#x51FA;&#x54CD;&#x5E94;&#x7684;&#x903B;&#x8F91;&#x5355;&#x5143;&#x3002;&#x8FC7;&#x7A0B;&#x7B26;&#x5408;&#x6211;&#x4EEC;&#x5BF9;&#x771F;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x601D;&#x8003;&#x6A21;&#x578B;: &#x5B9E;&#x4F53;&#x72EC;&#x7ACB;&#x5730;&#x76F8;&#x4E92;&#x4EA4;&#x4E92;&#x4E0E;&#x54CD;&#x5E94;&#xFF0C;&#x6CA1;&#x6709;&#x4E2D;&#x592E;&#x673A;&#x6784;&#x65BD;&#x52A0;&#x63A7;&#x5236;&#x3002;&#x4F60;&#x628A;&#x94B1;&#x653E;&#x8FDB;&#x673A;&#x5668;&#xFF0C;&#x51FA;&#x73B0;&#x4E00;&#x4E2A;&#x70ED;&#x72D7;&#xFF0C;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x5E76;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4EBA;&#x4ECE;&#x4E2D;&#x534F;&#x8C03;&#x3002;&#x8FD9;&#x4E0E;&#x4F60;&#x4E4B;&#x524D;&#x5B66;&#x4E60;&#x7684;&#x5E76;&#x53D1;&#x4E0D;&#x540C;&#xFF0C;&#x90A3;&#x4E9B;&#x6216;&#x662F;&#x4E3B;&#x63A7;&#x5236;&#x7EBF;&#x7A0B;&#x7684;&#x6269;&#x5C55;(&#x6BD4;&#x5982;<code>pmap</code>)&#xFF0C;&#x6216;&#x662F;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x901A;&#x4FE1;&#x7684;&#x4EFB;&#x52A1;(<code>future</code>&#x521B;&#x5EFA;&#x7684;&#x4E00;&#x6B21;&#x6027;&#x4EFB;&#x52A1;)&#x3002;</p>
<blockquote>
<p>It might be strange to think of a vending machine as a process: vending machines are noun-y and thing-y, and processes are verb-y and do-y. To get in the right mindset, try defining real-world objects as the sum of their event-driven behavior. When a seed gets watered, it sprouts; when a mother looks at her newborn child, she feels love; and when you watch <em>Star Wars Episode I</em>, you are filled with anger and despair. If you want to get super philosophical, consider whether it&#x2019;s possible to define every thing&#x2019;s essence as the set of the events it recognizes and how it responds. Is reality just the composition of hot dog vending machines?</p>
</blockquote>
<p>&#x628A;&#x8D29;&#x5356;&#x673A;&#x5F53;&#x4F5C;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x53EF;&#x80FD;&#x5F88;&#x5947;&#x602A;:&#x8D29;&#x5356;&#x673A;&#x662F;&#x540D;&#x8BCD;&#x6027;&#x7684;&#xFF0C;&#x8FC7;&#x7A0B;&#x662F;&#x52A8;&#x8BCD;&#x6027;&#x7684;&#x3002;&#x4E3A;&#x5F97;&#x5230;&#x6B63;&#x786E;&#x7684;&#x601D;&#x7EF4;&#xFF0C;&#x8BD5;&#x8BD5;&#x628A;&#x771F;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x7269;&#x4F53;&#x5B9A;&#x4E49;&#x6210;&#x5B83;&#x4EEC;&#x7684;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x7684;&#x884C;&#x4E3A;&#x7684;&#x603B;&#x548C;&#x3002;&#x7ED9;&#x4E00;&#x7C92;&#x79CD;&#x5B50;&#x6D47;&#x6C34;&#xFF0C;&#x5B83;&#x4F1A;&#x53D1;&#x82BD;&#xFF1B;&#x4E00;&#x4F4D;&#x6BCD;&#x4EB2;&#x770B;&#x5230;&#x5979;&#x7684;&#x65B0;&#x751F;&#x5B69;&#x5B50;&#xFF0C;&#x5979;&#x4F1A;&#x611F;&#x5230;&#x7231;&#xFF1B;&#x4F60;&#x770B;&#x4E86;<em>&#x661F;&#x6218;&#x524D;&#x4F20;1</em>&#xFF0C;&#x4F60;&#x5145;&#x6EE1;&#x4E86;&#x6124;&#x6012;&#x548C;&#x5931;&#x671B;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x4ECE;&#x54F2;&#x5B66;&#x4E0A;&#x601D;&#x8003;&#xFF0C;&#x8003;&#x8651;&#x4E00;&#x4E0B;&#xFF0C;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x628A;&#x6240;&#x6709;&#x4E1C;&#x897F;&#x7684;&#x672C;&#x8D28;&#x5B9A;&#x4E49;&#x4E3A;&#x5B83;&#x4EEC;&#x8BC6;&#x522B;&#x7684;&#x4E8B;&#x4EF6;&#x548C;&#x5982;&#x4F55;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x54CD;&#x5E94;&#x7684;&#x96C6;&#x5408;&#x3002;&#x73B0;&#x5B9E;&#x662F;&#x5426;&#x53EA;&#x662F;&#x70ED;&#x72D7;&#x8D29;&#x5356;&#x673A;&#x7684;&#x7EC4;&#x5408;&#x5462;&#xFF1F;</p>
<blockquote>
<p>Anyway, enough of my yakking! Let&#x2019;s move from the theoretical to the concrete by creating some simple processes. First, create a new Leiningen project called <em>playsync</em> with <em>lein new app playsync</em>. Then, open the file <em>project.clj</em> and add core.async to the <code>:dependencies</code> vector so it reads as follows:</p>
</blockquote>
<p>&#x603B;&#x4E4B;&#xFF0C;&#x8BB2;&#x7684;&#x591F;&#x591A;&#x4E86;&#xFF01;&#x8BA9;&#x6211;&#x4EEC;&#x4ECE;&#x7406;&#x8BBA;&#x8F6C;&#x79FB;&#x5230;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x4F8B;&#x5B50;&#x4E0A;&#x3002;&#x7528;<em>lein new app playsync</em>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x53EB;&#x505A;<em>playsync</em>&#x7684;&#x9879;&#x76EE;&#x3002;&#x7136;&#x540E;&#x6253;&#x5F00;&#x6587;&#x4EF6;<em>projcect.clj</em>&#x5E76;&#x5F80;<code>:dependencies</code>&#x91CC;&#x6DFB;&#x52A0;core.async,&#x5982;&#x4E0B;&#x6240;&#x793A;:</p>
<figure class="highlight clojure"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">[[org.clojure/clojure <span class="string">&quot;1.7.0&quot;</span>]</span><br><span class="line">[org.clojure/core.async <span class="string">&quot;0.1.346.0-17112a-alpha&quot;</span>]]</span><br></pre></td></tr></table></figure>
<blockquote>
<p>Note    It&#x2019;s possible that the core.async version has advanced since I wrote this. For the latest version, check the core.async GitHub project page. But for the purpose of these exercises, please use the version listed here.</p>
</blockquote>
<p>&#x6CE8;&#x610F;&#xFF0C;core.async&#x7684;&#x7248;&#x672C;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x66F4;&#x65B0;&#x4E86;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x53BB;&#x5B83;&#x7684;GitHub&#x9879;&#x76EE;&#x4ED3;&#x5E93;&#x67E5;&#x770B;&#x6700;&#x65B0;&#x7248;&#x3002;&#x4F46;&#x51FA;&#x4E8E;&#x7EC3;&#x4E60;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x8BF7;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x7248;&#x672C;&#x3002;</p>
<blockquote>
<p>Next, open <em>src/playsync/core.clj</em> and make it look like this:</p>
</blockquote>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6253;&#x5F00;<em>src/playsync/core.clj</em> &#xFF0C;&#x4F7F;&#x5B83;&#x53D8;&#x6210;&#x8FD9;&#x6837;:</p>
<figure class="highlight clojure"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name"><span class="builtin-name">ns</span></span> playsync.core</span><br><span class="line">  (<span class="symbol">:require</span> [clojure.core.async</span><br><span class="line">             <span class="symbol">:as</span> a</span><br><span class="line">             <span class="symbol">:refer</span> [&gt;! &lt;! &gt;!! &lt;!! go chan buffer close! thread</span><br><span class="line">                     alts! alts!! timeout]]))</span><br></pre></td></tr></table></figure>
<blockquote>
<p>Now when you open this in a REPL, you&#x2019;ll have the most frequently used core.async functions at your disposal. Great! Before creating something as sophisticated and revolutionary as a hot dog vending machine, create a process that simply prints the message it receives:</p>
</blockquote>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6253;&#x5F00;REPL&#xFF0C;&#x4F60;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;core.async&#x91CC;&#x6700;&#x5E38;&#x7528;&#x7684;&#x51FD;&#x6570;&#x4E86;&#x3002;&#x5F88;&#x597D;&#xFF01;&#x5148;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6253;&#x5370;&#x5B83;&#x6536;&#x5230;&#x7684;&#x6D88;&#x606F;:</p>
<figure class="highlight clojure"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name"><span class="builtin-name">def</span></span> echo-chan (<span class="name">chan</span>))</span><br><span class="line">(<span class="name">go</span> (<span class="name">println</span> (<span class="name">&lt;!</span> echo-chan)))</span><br><span class="line">(<span class="name">&gt;!!</span> echo-chan <span class="string">&quot;ketchup&quot;</span>)</span><br><span class="line"><span class="comment">; =&gt; true</span></span><br><span class="line"><span class="comment">; =&gt; ketchup</span></span><br></pre></td></tr></table></figure>
<blockquote>
<p>At the first line of code, you used the <code>chan</code> function to create a <em>channel</em> named <code>echo-chan</code>. Channels communicate <em>messages</em>. You can put messages on a channel and take messages off a channel. Processes <em>wait</em> for the completion of put and take&#x2014;these are the events that processes respond to. You can think of processes as having two rules: 1) when trying to put a message on a channel or take a message off of it, wait and do nothing until the put or take succeeds, and 2) when the put or take succeeds, continue executing.</p>
</blockquote>
<p>&#x7B2C;&#x4E00;&#x884C;&#x7528;<code>chan</code>&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x53EB;&#x505A;<code>echo-chan</code>&#x7684;<em>&#x901A;&#x9053;</em>&#x3002;&#x901A;&#x9053;&#x4F20;&#x9012;<em>&#x6D88;&#x606F;</em>&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x6D88;&#x606F;&#x653E;&#x8FDB;&#x901A;&#x9053;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;&#x901A;&#x9053;&#x53D6;&#x5F97;&#x6D88;&#x606F;&#x3002;&#x8FC7;&#x7A0B;&#x4F1A;<em>&#x7B49;&#x7740;</em>&#x653E;&#x8FDB;&#x6216;&#x53D6;&#x5F97;&#xFF0C;&#x653E;&#x8FDB;&#x6216;&#x53D6;&#x5F97;&#x6210;&#x529F;&#x65F6;&#xFF0C;&#x4F1A;&#x51FA;&#x73B0;&#x5BF9;&#x5E94;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x8FC7;&#x7A0B;&#x4F1A;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#x8FDB;&#x884C;&#x54CD;&#x5E94;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x8FC7;&#x7A0B;&#x6709;&#x4E24;&#x4E2A;&#x89C4;&#x5219;: 1) &#x5F53;&#x5C1D;&#x8BD5;&#x5728;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#x653E;&#x8FDB;&#x6216;&#x53D6;&#x5F97;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x7B49;&#x7740;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x5E72;&#xFF0C;&#x76F4;&#x5230;&#x653E;&#x8FDB;&#x6216;&#x53D6;&#x5F97;&#x6210;&#x529F;&#x3002;2) &#x5F53;&#x653E;&#x8FDB;&#x6216;&#x53D6;&#x5F97;&#x6210;&#x529F;&#x65F6;&#xFF0C;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;</p>
<blockquote>
<p>On the next line, you used <code>go</code> to create a new process. Everything within the <code>go</code> expression&#x2014;called a <em>go block</em>&#x2014;runs concurrently on a separate thread. Go blocks run your processes on a thread pool that contains a number of threads equal to two plus the number of cores on your machine, which means your program doesn&#x2019;t have to create a new thread for each process. This often results in better performance because you avoid the overhead associated with creating threads.</p>
</blockquote>
<p>&#x4E0B;&#x4E00;&#x884C;&#xFF0C;&#x7528;<code>go</code>&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x8FC7;&#x7A0B;&#x3002;<code>go</code>&#x8868;&#x8FBE;&#x5F0F;&#x91CC;&#x7684;&#x6240;&#x6709;&#x4E1C;&#x897F;(&#x53EB;<em>go block</em>)&#x90FD;&#x5E76;&#x53D1;&#x8FD0;&#x884C;&#x5728;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7EBF;&#x7A0B;&#x4E0A;&#x3002;go block&#x628A;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6C60;&#x91CC;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x6C60;&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#x7B49;&#x4E8E;&#x5904;&#x7406;&#x5668;&#x5185;&#x6838;&#x6570;&#x52A0;&#x4E0A;2&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x4E0D;&#x4F1A;&#x4E3A;&#x6BCF;&#x4E2A;&#x8FC7;&#x7A0B;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7EBF;&#x7A0B;&#x3002;&#x8FD9;&#x907F;&#x514D;&#x4E86;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x7684;&#x635F;&#x8017;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x4F7F;&#x6027;&#x80FD;&#x66F4;&#x597D;&#x3002;</p>
<blockquote>
<p>In this case, the process <code>(println (&lt;! echo-chan))</code> expresses &#x201C;when I take a message from <code>echo-chan</code>, print it.&#x201D; The process is shunted to another thread, freeing up the current thread and allowing you to continue interacting with the REPL.</p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;&#x8FC7;&#x7A0B;<code>(println (&lt;! echo-chan))</code>&#x8868;&#x8FF0;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF1A;&#x201D;&#x5F53;&#x6211;&#x4ECE;<code>echo-chan</code>&#x53D6;&#x5F97;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x6253;&#x5370;&#x8FD9;&#x4E2A;&#x6D88;&#x606F;&#x3002;&#x201D;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x88AB;&#x8F6C;&#x79FB;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E0A;&#xFF0C;&#x91CA;&#x653E;&#x51FA;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#xFF0C;&#x5141;&#x8BB8;&#x4F60;&#x7EE7;&#x7EED;&#x4E0E;REPL&#x4EA4;&#x4E92;&#x3002;</p>
<blockquote>
<p>In the expression <code>(&lt;! echo-chan)</code>, <code>&lt;!</code> is the <em>take</em> function. It listens to the channel you give it as an argument, and the process it belongs to waits until another process puts a message on the channel. When <code>&lt;!</code> retrieves a value, the value is returned and the <code>println</code> expression is executed.</p>
</blockquote>
<p>&#x8868;&#x8FBE;&#x5F0F;<code>(&lt;! echo-chan)</code>&#x91CC;&#x7684;<code>&lt;!</code>&#x662F;<em>take</em>&#x51FD;&#x6570;&#x3002;&#x5B83;&#x76D1;&#x542C;&#x901A;&#x9053;&#x53C2;&#x6570;&#xFF0C;&#x5305;&#x542B;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x8FC7;&#x7A0B;&#x4F1A;&#x7B49;&#x5F85;&#xFF0C;&#x76F4;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x5728;&#x8FD9;&#x4E2A;&#x901A;&#x9053;&#x4E0A;&#x653E;&#x5165;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x3002;&#x5F53;<code>&lt;!</code>&#x53D6;&#x5F97;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x88AB;&#x8FD4;&#x56DE;&#xFF0C;<code>println</code>&#x8868;&#x8FBE;&#x5F0F;&#x88AB;&#x6267;&#x884C;&#x3002;</p>
<blockquote>
<p>The expression <code>(&gt;!! echo-chan &quot;ketchup&quot;)</code> puts the string <code>&quot;ketchup&quot;</code> on <code>echo-chan</code> and returns <code>true</code>. When you put a message on a channel, the process blocks until another process takes the message. In this case, the REPL process didn&#x2019;t have to wait at all, because there was already a process listening to the channel, waiting to take something off it. However, if you do the following, your REPL will block indefinitely:</p>
</blockquote>
<p>&#x8868;&#x8FBE;&#x5F0F;<code>(&gt;!! echo-chan &quot;ketchup&quot;)</code>&#x628A;&#x5B57;&#x7B26;&#x4E32;<code>&quot;ketchup&quot;</code>&#x653E;&#x5728;<code>echo-chan</code>&#x4E0A;&#x5E76;&#x8FD4;&#x56DE;<code>true</code>&#x3002;&#x5F53;&#x4F60;&#x5728;&#x4E00;&#x4E2A;&#x9891;&#x9053;&#x653E;&#x8FDB;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4F1A;&#x963B;&#x585E;&#xFF0C;&#x76F4;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x53D6;&#x5F97;&#x8FD9;&#x4E2A;&#x6D88;&#x606F;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;REPL&#x8FDB;&#x7A0B;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#xFF0C;&#x56E0;&#x4E3A;&#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x6B63;&#x5728;&#x76D1;&#x542C;&#x8FD9;&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x7B49;&#x5F85;&#x53D6;&#x5F97;&#x6D88;&#x606F;&#x3002;&#x4F46;&#x5982;&#x679C;&#x8FD9;&#x4E48;&#x5E72;&#xFF0C;REPL&#x5C06;&#x4F1A;&#x65E0;&#x9650;&#x963B;&#x585E;:</p>
<figure class="highlight clojure"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name">&gt;!!</span> (<span class="name">chan</span>) <span class="string">&quot;mustard&quot;</span>)</span><br></pre></td></tr></table></figure>
<blockquote>
<p>You&#x2019;ve created a new channel and put something on it, but there&#x2019;s no process listening to that channel. Processes don&#x2019;t just wait to receive messages; they also wait for the messages they put on a channel to be taken.</p>
</blockquote>
<p>&#x4F60;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x901A;&#x9053;&#xFF0C;&#x5E76;&#x5728;&#x5B83;&#x4E0A;&#x9762;&#x653E;&#x8FDB;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x8FC7;&#x7A0B;&#x6B63;&#x5728;&#x76D1;&#x542C;&#x8FD9;&#x4E2A;&#x901A;&#x9053;&#x3002;&#x8FC7;&#x7A0B;&#x4E0D;&#x4EC5;&#x4EC5;&#x7B49;&#x5F85;&#x63A5;&#x6536;&#x6D88;&#x606F;&#xFF0C;&#x4E5F;&#x7B49;&#x5F85;&#x653E;&#x8FDB;&#x901A;&#x9053;&#x7684;&#x6D88;&#x606F;&#x88AB;&#x53D6;&#x8D70;&#x3002;</p>
<blockquote>
<p>Buffering</p>
</blockquote>
<h3 id="&#x7F13;&#x51B2;"><a href="#&#x7F13;&#x51B2;" class="headerlink" title="&#x7F13;&#x51B2;"></a>&#x7F13;&#x51B2;</h3><blockquote>
<p>It&#x2019;s worth noting that the previous exercise contained two processes: the one you created with <code>go</code> and the REPL process. These processes don&#x2019;t have explicit knowledge of each other, and they act independently.</p>
</blockquote>
<p>&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x524D;&#x9762;&#x7684;&#x7EC3;&#x4E60;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x8FC7;&#x7A0B;: &#x7528;<code>go</code>&#x521B;&#x5EFA;&#x7684;&#x548C;REPL&#x3002;&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x4E92;&#x76F8;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x5E76;&#x4E14;&#x72EC;&#x7ACB;&#x884C;&#x52A8;&#x3002;</p>
<blockquote>
<p>Let&#x2019;s imagine that these processes take place in a diner. The REPL is the ketchup chef, and when he&#x2019;s done with a batch, he belts out, &#x201C;Ketchup!&#x201D; It&#x2019;s entirely possible that the rest of the staff is outside admiring the latest batch of oregano in their organic garden, and the chef just sits and waits until someone shows up to take his ketchup. On the flip side, the <code>go</code> process represents one of the staff, and he&#x2019;s waiting patiently for something to respond to. It could be that nothing ever happens, and he just waits indefinitely until the restaurant closes.</p>
</blockquote>
<p>&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x53D1;&#x751F;&#x5728;&#x4E00;&#x4E2A;&#x9910;&#x5385;&#x91CC;&#x3002;REPL&#x662F;&#x756A;&#x8304;&#x9171;&#x5927;&#x53A8;&#xFF0C;&#x5F53;&#x4ED6;&#x505A;&#x597D;&#x4E00;&#x6279;&#x65F6;&#xFF0C;&#x5927;&#x58F0;&#x558A;&#x5230;&#x201D;&#x201C;Ketchup!&#x201D;&#x3002;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x5176;&#x4ED6;&#x4EBA;&#x6B63;&#x5728;&#x5916;&#x9762;&#x804A;&#x5929;&#xFF0C;&#x5927;&#x53A8;&#x53EA;&#x662F;&#x5750;&#x7740;&#x5E76;&#x7B49;&#x7740;&#x67D0;&#x4EBA;&#x51FA;&#x73B0;&#x62FF;&#x8D70;&#x4ED6;&#x7684;&#x756A;&#x8304;&#x9171;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;<code>go</code>&#x8FC7;&#x7A0B;&#x4EE3;&#x8868;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x4ED6;&#x6B63;&#x5728;&#x8010;&#x5FC3;&#x7B49;&#x5F85;&#x67D0;&#x79CD;&#x4E1C;&#x897F;&#xFF0C;&#x51C6;&#x5907;&#x505A;&#x51FA;&#x54CD;&#x5E94;&#x3002;&#x6709;&#x53EF;&#x80FD;&#x4EC0;&#x4E48;&#x4E5F;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#xFF0C;&#x4ED6;&#x65E0;&#x9650;&#x7B49;&#x7740;&#x76F4;&#x5230;&#x996D;&#x9986;&#x5173;&#x95E8;&#x3002;</p>
<blockquote>
<p>This situation seems a little silly: what self-respecting ketchup chef would just sit and wait for someone to take his latest batch before making more ketchup? To avoid this tragedy, you can create buffered channels:</p>
</blockquote>
<p>&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x770B;&#x7740;&#x6709;&#x70B9;&#x50BB;&#xFF0C;&#x5927;&#x53A8;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x7B49;&#x7740;&#x800C;&#x4E0D;&#x53BB;&#x505A;&#x66F4;&#x591A;&#x7684;&#x756A;&#x8304;&#x9171;&#x5462;&#xFF1F;&#x4E3A;&#x907F;&#x514D;&#x8FD9;&#x4E2A;&#x60B2;&#x5267;&#xFF0C;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x6709;&#x7F13;&#x51B2;&#x7684;&#x901A;&#x9053;:</p>
<figure class="highlight clojure"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name"><span class="builtin-name">def</span></span> echo-buffer (<span class="name">chan</span> <span class="number">2</span>))</span><br><span class="line">(<span class="name">&gt;!!</span> echo-buffer <span class="string">&quot;ketchup&quot;</span>)</span><br><span class="line"><span class="comment">; =&gt; true</span></span><br><span class="line">(<span class="name">&gt;!!</span> echo-buffer <span class="string">&quot;ketchup&quot;</span>)</span><br><span class="line"><span class="comment">; =&gt; true</span></span><br><span class="line">(<span class="name">&gt;!!</span> echo-buffer <span class="string">&quot;ketchup&quot;</span>)</span><br><span class="line"><span class="comment">; This blocks because the channel buffer is full</span></span><br></pre></td></tr></table></figure>
<blockquote>
<p>(Be careful evaluating the last <code>(&gt;!! echo-buffer &quot;ketchup&quot;)</code> because it will block your REPL. If you&#x2019;re using a Leiningen REPL, ctrl-C will unblock it.)</p>
</blockquote>
<p>(&#x5C0F;&#x5FC3;&#xFF0C;&#x6C42;&#x503C;&#x6700;&#x540E;&#x4E00;&#x4E2A;<code>(&gt;!! echo-buffer &quot;ketchup&quot;)</code>&#x65F6;&#xFF0C;REPL&#x4F1A;&#x963B;&#x585E;&#x3002;ctrl-C&#x53EF;&#x4EE5;&#x89E3;&#x9501;)</p>
<blockquote>
<p>In this case, you&#x2019;ve created a channel with buffer size 2. That means you can put two values on the channel without waiting, but putting a third one on means the process will wait until another process takes a value from the channel. You can also create sliding buffers with <code>sliding-buffer</code>, which drops values in a first-in, first-out fashion; and <em>dropping</em> buffers with <code>dropping-buffer</code>, which discards values in a last-in, first-out fashion. Neither of these buffers will ever cause <code>&gt;!!</code> to block.</p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x7F13;&#x51B2;&#x5927;&#x5C0F;&#x662F;2&#x7684;&#x901A;&#x9053;&#x3002;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x65E0;&#x9700;&#x7B49;&#x5F85;&#x5730;&#x653E;&#x5165;&#x4E24;&#x4E2A;&#x503C;&#xFF0C;&#x4F46;&#x653E;&#x8FDB;&#x7B2C;&#x4E09;&#x4E2A;&#x503C;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x8981;&#x7B49;&#x5F85;&#x5176;&#x4ED6;&#x8FC7;&#x7A0B;&#x628A;&#x8FD9;&#x4E2A;&#x503C;&#x53D6;&#x8D70;&#x3002;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;<code>sliding-buffer</code>&#x521B;&#x5EFA;<em>&#x6ED1;&#x52A8;&#x7F13;&#x51B2;</em>&#xFF0C;&#x5B83;&#x4F1A;&#x6309;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#x7684;&#x65B9;&#x5F0F;&#x4E22;&#x5F03;&#x503C;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;<code>dropping-buffer</code>&#x521B;&#x5EFA;<em>&#x4E22;&#x5F03;&#x7F13;&#x51B2;</em>&#xFF0C;&#x5B83;&#x4F1A;&#x6309;&#x540E;&#x8FDB;&#x5148;&#x51FA;&#x7684;&#x65B9;&#x5F0F;&#x4E22;&#x5F03;&#x503C;&#x3002;&#x8FD9;&#x4E24;&#x79CD;&#x7F13;&#x51B2;&#x90FD;&#x4E0D;&#x4F1A;&#x4F7F;<code>&gt;!!</code>&#x963B;&#x585E;&#x3002;</p>
<blockquote>
<p>By using buffers, the master ketchup chef can keep whipping up batches of mouthwatering ketchup without having to wait for his staff to take them away. If he&#x2019;s using a regular buffer, it&#x2019;s like he has a shelf to put all his ketchup batches on; once the shelf is full, he&#x2019;ll still have to wait for space to open up. If he&#x2019;s using a sliding buffer, he&#x2019;d throw away the oldest batch of ketchup when the shelf is full, slide all the ketchup down, and put the new batch in the vacant space. With a dropping buffer, he&#x2019;d just knock the freshest batch off of the shelf and put his new batch in that space.</p>
</blockquote>
<p>&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x7F13;&#x51B2;&#xFF0C;&#x756A;&#x8304;&#x9171;&#x5927;&#x53A8;&#x53EF;&#x4EE5;&#x6301;&#x7EED;&#x5236;&#x4F5C;&#x756A;&#x8304;&#x9171;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x7B49;&#x5F85;&#x505A;&#x597D;&#x7684;&#x88AB;&#x53D6;&#x8D70;&#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x666E;&#x901A;&#x7F13;&#x51B2;&#xFF0C;&#x5C31;&#x50CF;&#x4ED6;&#x6709;&#x4E2A;&#x653E;&#x7F6E;&#x505A;&#x597D;&#x7684;&#x756A;&#x8304;&#x9171;&#x7684;&#x67B6;&#x5B50;&#xFF0C;&#x4E00;&#x65E6;&#x67B6;&#x5B50;&#x653E;&#x6EE1;&#x4E86;&#xFF0C;&#x4ED6;&#x8FD8;&#x662F;&#x8981;&#x7B49;&#x5F85;&#x67B6;&#x5B50;&#x4E0A;&#x51FA;&#x73B0;&#x7A7A;&#x4F59;&#x4F4D;&#x7F6E;&#x3002;&#x5982;&#x679C;&#x4ED6;&#x7528;&#x7684;&#x662F;&#x6ED1;&#x52A8;&#x7F13;&#x51B2;&#xFF0C;&#x67B6;&#x5B50;&#x6EE1;&#x4E86;&#xFF0C;&#x4ED6;&#x5C31;&#x6254;&#x6389;&#x6700;&#x65E7;&#x7684;&#x756A;&#x8304;&#x9171;&#xFF0C;&#x6ED1;&#x52A8;&#x6240;&#x6709;&#x7684;&#x756A;&#x8304;&#x9171;&#xFF0C;&#x628A;&#x65B0;&#x756A;&#x8304;&#x9171;&#x653E;&#x5728;&#x7A7A;&#x51FA;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x5982;&#x679C;&#x7528;&#x7684;&#x662F;&#x4E22;&#x5F03;&#x7F13;&#x51B2;&#xFF0C;&#x4ED6;&#x4F1A;&#x6254;&#x6389;&#x67B6;&#x5B50;&#x4E0A;&#x6700;&#x65B0;&#x7684;&#x756A;&#x8304;&#x9171;&#xFF0C;&#x628A;&#x65B0;&#x505A;&#x7684;&#x653E;&#x5728;&#x90A3;&#x4E2A;&#x4F4D;&#x7F6E;&#x4E0A;&#x3002;</p>
<blockquote>
<p>Buffers are just elaborations of the core model: processes are independent, concurrently executing units of logic that respond to events. You can create processes with go blocks and communicate events over channels.</p>
</blockquote>
<p>&#x7F13;&#x51B2;&#x53EA;&#x662F;&#x6838;&#x5FC3;&#x6A21;&#x578B;&#x7684;&#x8BE6;&#x7EC6;&#x9610;&#x8FF0;: &#x8FC7;&#x7A0B;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x5BF9;&#x4E8B;&#x4EF6;&#x505A;&#x51FA;&#x54CD;&#x5E94;&#x7684;&#x903B;&#x8F91;&#x5355;&#x5143;&#x3002;&#x53EF;&#x4EE5;&#x7528;go blocks&#x521B;&#x5EFA;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x901A;&#x9053;&#x4F20;&#x8FBE;&#x4E8B;&#x4EF6;&#x3002;</p>
<blockquote>
<p>Blocking and Parking</p>
</blockquote>
<h3 id="&#x963B;&#x585E;&#x4E0E;&#x505C;&#x6CCA;"><a href="#&#x963B;&#x585E;&#x4E0E;&#x505C;&#x6CCA;" class="headerlink" title="&#x963B;&#x585E;&#x4E0E;&#x505C;&#x6CCA;"></a>&#x963B;&#x585E;&#x4E0E;&#x505C;&#x6CCA;</h3><blockquote>
<p>You may have noticed that the take function <code>&lt;!</code> used only one exclamation point, whereas the put function <code>&gt;!!</code> used two. In fact, both put and take have one-exclamation-point and two-exclamation-point varieties. When do you use which? The simple answer is that you can use one exclamation point inside go blocks, but you have to use two exclamation points outside of them:</p>
</blockquote>
<p>&#x4F60;&#x53EF;&#x80FD;&#x6CE8;&#x610F;&#x5230;take&#x51FD;&#x6570;<code>&lt;!</code>&#x7528;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x53F9;&#x53F7;&#xFF0C;put&#x51FD;&#x6570;<code>&gt;!!</code>&#x7528;&#x7684;&#x662F;&#x4E24;&#x4E2A;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x548C;&#x4E24;&#x4E2A;&#x7684;&#x5F62;&#x5F0F;&#x3002;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x7528;&#x54EA;&#x4E2A;&#xFF1F;&#x7B80;&#x5355;&#x7B54;&#x6848;&#x662F;&#x5728;go block&#x91CC;&#x7528;&#x4E00;&#x4E2A;&#x53F9;&#x53F7;&#xFF0C;&#x5728;&#x5176;&#x5916;&#x7528;&#x4E24;&#x4E2A;&#x53F9;&#x53F7;:</p>
<table>
<thead>
<tr>
<th></th>
<th>Inside go block</th>
<th>Outside go block</th>
</tr>
</thead>
<tbody>
<tr>
<td>put</td>
<td>&gt;! or &gt;!!</td>
<td>&gt;!!</td>
</tr>
<tr>
<td>take</td>
<td>&lt;! or &lt;!!</td>
<td>&lt;!!</td>
</tr>
</tbody>
</table>
<blockquote>
<p>It all comes down to efficiency. Because go blocks use a thread pool with a fixed size, you can create 1,000 go processes but use only a handful of threads:</p>
</blockquote>
<p>&#x6240;&#x6709;&#x539F;&#x56E0;&#x90FD;&#x5F52;&#x7ED3;&#x4E3A;&#x6548;&#x7387;&#x3002;&#x56E0;&#x4E3A;go blocks&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x7EBF;&#x7A0B;&#x6C60;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;1000&#x4E2A;go&#x8FC7;&#x7A0B;&#xFF0C;&#x4F46;&#x53EA;&#x4F7F;&#x7528;&#x51E0;&#x4E2A;&#x7EBF;&#x7A0B;:</p>
<figure class="highlight clojure"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name"><span class="builtin-name">def</span></span> hi-chan (<span class="name">chan</span>))</span><br><span class="line">(<span class="name"><span class="builtin-name">doseq</span></span> [n (<span class="name"><span class="builtin-name">range</span></span> <span class="number">1000</span>)]</span><br><span class="line">  (<span class="name">go</span> (<span class="name">&gt;!</span> hi-chan (<span class="name"><span class="builtin-name">str</span></span> <span class="string">&quot;hi &quot;</span> n))))</span><br></pre></td></tr></table></figure>
<blockquote>
<p>To understand how Clojure accomplishes this, we need to explore how processes <em>wait</em>. Waiting is a key aspect of working with core.async processes: we&#x2019;ve already established that put waits until another process does a <em>take</em> on the same channel, and vice versa. In this example, 1,000 processes are waiting for another process to take from <code>hi-chan</code>.</p>
</blockquote>
<p>&#x4E3A;&#x4E86;&#x7406;&#x89E3;Clojure&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x8FD9;&#x4EF6;&#x4E8B;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x8FDB;&#x7A0B;&#x662F;&#x5982;&#x4F55;<em>&#x7B49;&#x5F85;</em>&#x7684;&#x3002;&#x7B49;&#x5F85;&#x662F;&#x4E00;&#x4E2A;core.async&#x5DE5;&#x4F5C;&#x7684;&#x5173;&#x952E;&#x56E0;&#x7D20;&#xFF1A;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#xFF0C;<em>&#x653E;&#x5165;</em> &#x4F1A;&#x7B49;&#x5F85;&#x76F4;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x5728;&#x540C;&#x4E00;&#x901A;&#x9053;&#x505A;&#x4E00;&#x4E2A;<em>&#x53D6;&#x5F97;</em>&#x64CD;&#x4F5C;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;1000&#x4E2A;&#x8FC7;&#x7A0B;&#x6B63;&#x5728;&#x7B49;&#x5F85;&#x53E6;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x4ECE;<code>hi-chan</code>&#x505A;&#x53D6;&#x5F97;&#x64CD;&#x4F5C;&#x3002;</p>
<blockquote>
<p>There are two varieties of waiting: <em>parking</em> and <em>blocking</em>. Blocking is the kind of waiting you&#x2019;re familiar with: a thread stops execution until a task is complete. Usually this happens when you&#x2019;re doing some kind of I/O operation. The thread remains alive but doesn&#x2019;t do any work, so you have to create a new thread if you want your program to continue working. In Chapter 9, you learned how to do this with <code>future</code>.</p>
</blockquote>
<p>&#x7B49;&#x5F85;&#x6709;&#x4E24;&#x79CD;&#x53D8;&#x4F53;&#xFF1A;<em>&#x505C;&#x6CCA;</em> &#x548C; <em>&#x963B;&#x585E;</em>&#x3002;&#x963B;&#x585E;&#x662F;&#x4F60;&#x719F;&#x6089;&#x7684;&#x90A3;&#x79CD;&#x7B49;&#x5F85;: &#x7EBF;&#x7A0B;&#x505C;&#x6B62;&#x6267;&#x884C;&#x76F4;&#x5230;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x3002;&#x8FD9;&#x901A;&#x5E38;&#x53D1;&#x751F;&#x5728;&#x8FDB;&#x884C;&#x67D0;&#x4E9B;I/O&#x64CD;&#x4F5C;&#x65F6;&#x3002;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x4FDD;&#x6301;&#x5B58;&#x6D3B;&#xFF0C;&#x4F46;&#x4EC0;&#x4E48;&#x5DE5;&#x4F5C;&#x90FD;&#x4E0D;&#x5E72;&#xFF0C;&#x4E3A;&#x4E86;&#x7A0B;&#x5E8F;&#x7EE7;&#x7EED;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F60;&#x4E0D;&#x5F97;&#x4E0D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7EBF;&#x7A0B;&#x3002;&#x5728;&#x7B2C;&#x4E5D;&#x7AE0;&#xFF0C;&#x4F60;&#x5B66;&#x8FC7;&#x5982;&#x4F55;&#x7528;<code>future</code>&#x5E72;&#x8FD9;&#x4EF6;&#x4E8B;,<a href="https://morrxy.github.io/2016/07/15/braveclojure-concurrency/#&#x672A;&#x6765;" target="_blank" rel="external">&#x70B9;&#x6B64;&#x67E5;&#x770B;</a>&#x3002;</p>
<blockquote>
<p>Parking frees up the thread so it can keep doing work. Let&#x2019;s say you have one thread and two processes, Process A and Process B. Process A is running on the thread and then waits for a put or take. Clojure moves Process A off the thread and moves Process B onto the thread. If Process B starts waiting and Process A&#x2019;s put or take has finished, then Clojure will move Process B off the thread and put Process A back on it. Parking allows the instructions from multiple processes to interleave on a single thread, similar to the way that using multiple threads allows interleaving on a single core. The implementation of parking isn&#x2019;t important; suffice it to say that it&#x2019;s only possible within go blocks, and it&#x2019;s only possible when you use <code>&gt;!</code> and <code>&lt;!</code>, or parking put and parking take. <code>&gt;!!</code> and <code>&lt;!!</code> are <em>blocking put</em> and <em>blocking take</em>.</p>
</blockquote>
<p>&#x505C;&#x6CCA;&#x91CA;&#x653E;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#xFF0C;&#x8BA9;&#x5B83;&#x80FD;&#x7EE7;&#x7EED;&#x5DE5;&#x4F5C;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x548C;&#x4E24;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x8FC7;&#x7A0B;A&#x548C;&#x8FC7;&#x7A0B;B&#x3002;&#x8FC7;&#x7A0B;A&#x6B63;&#x5728;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x7136;&#x540E;&#x7B49;&#x5F85;&#x4E00;&#x4E2A;&#x653E;&#x5165;&#x6216;&#x53D6;&#x5F97;&#x3002;Clojure&#x628A;&#x8FC7;&#x7A0B;A&#x4ECE;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x632A;&#x8D70;&#xFF0C;&#x5E76;&#x628A;&#x8FC7;&#x7A0B;B&#x632A;&#x5230;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E0A;&#x3002;&#x5982;&#x679C;&#x8FC7;&#x7A0B;B&#x5F00;&#x59CB;&#x7B49;&#x5F85;&#xFF0C;&#x5E76;&#x4E14;&#x8FC7;&#x7A0B;A&#x7684;&#x653E;&#x5165;&#x6216;&#x53D6;&#x5F97;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#xFF0C;&#x90A3;&#x4E48;Clojure&#x628A;&#x8FC7;&#x7A0B;B&#x4ECE;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x632A;&#x8D70;&#xFF0C;&#x5E76;&#x628A;&#x8FC7;&#x7A0B;A&#x632A;&#x56DE;&#x6765;&#x3002;&#x505C;&#x6CCA;&#x8BA9;&#x591A;&#x4E2A;&#x8FC7;&#x7A0B;&#x7684;&#x6307;&#x4EE4;&#x5728;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E0A;&#x4EA4;&#x66FF;&#x6267;&#x884C;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x5355;&#x6838;&#x4E0A;&#x7684;&#x591A;&#x7EBF;&#x7A0B;&#x4EA4;&#x66FF;&#x6267;&#x884C;&#x3002;&#x505C;&#x6CCA;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x77E5;&#x9053;&#x53EA;&#x80FD;&#x5728;go block&#x91CC;&#x8FDB;&#x884C;<code>&gt;!</code>&#x6216;<code>&lt;!</code>&#x3002;<code>&gt;!</code>&#x53EB;&#x505A;<em>&#x505C;&#x6CCA;&#x653E;&#x8FDB;</em>(parking put),<code>&lt;!</code>&#x53EB;&#x505A;<em>&#x505C;&#x6CCA;&#x53D6;&#x5F97;</em>(parking take),<code>&gt;!!</code>&#x53EB;&#x505A;<em>&#x963B;&#x585E;&#x653E;&#x8FDB;</em>(blocking put),<code>&lt;!!</code>&#x53EB;&#x505A;<em>&#x963B;&#x585E;&#x53D6;&#x5F97;</em>(blocking take)&#x3002;</p>
<blockquote>
<p>thread</p>
</blockquote>
<h3 id="thread"><a href="#thread" class="headerlink" title="thread"></a>thread</h3><blockquote>
<p>There are definitely times when you&#x2019;ll want to use blocking instead of parking, like when your process will take a long time before putting or taking, and for those occasions you should use <code>thread</code>:</p>
</blockquote>
<p>&#x6709;&#x65F6;&#x5019;&#x4F60;&#x60F3;&#x4F7F;&#x7528;&#x963B;&#x585E;&#x800C;&#x4E0D;&#x60F3;&#x7528;&#x505C;&#x6CCA;,&#x6BD4;&#x5982;&#x4F60;&#x7684;&#x8FC7;&#x7A0B;&#x653E;&#x8FDB;&#x6216;&#x53D6;&#x5F97;&#x524D;&#xFF0C;&#x5C06;&#x82B1;&#x8D39;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;<code>thread</code>:</p>
<figure class="highlight clojure"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name">thread</span> (<span class="name">println</span> (<span class="name">&lt;!!</span> echo-chan)))</span><br><span class="line">(<span class="name">&gt;!!</span> echo-chan <span class="string">&quot;mustard&quot;</span>)</span><br><span class="line"><span class="comment">; =&gt; true</span></span><br><span class="line"><span class="comment">; =&gt; mustard</span></span><br></pre></td></tr></table></figure>
<blockquote>
<p><code>thread</code> acts almost exactly like <code>future</code>: it creates a new thread and executes a process on that thread. Unlike <code>future</code>, instead of returning an object that you can dereference, <code>thread</code> returns a channel. When <code>thread</code>&#x2019;s process stops, the process&#x2019;s return value is put on the channel that <code>thread</code> returns:</p>
</blockquote>
<p><code>thread</code>&#x7684;&#x884C;&#x4E3A;&#x51E0;&#x4E4E;&#x4E0E;<code>future</code>&#x4E00;&#x6837;: &#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7EBF;&#x7A0B;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x90A3;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E0A;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x4E0D;&#x50CF;<code>future</code>&#x90A3;&#x6837;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x53D6;&#x503C;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;<code>thread</code>&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#x3002;&#x5F53;<code>thread</code>&#x7684;&#x8FC7;&#x7A0B;&#x505C;&#x6B62;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x88AB;&#x653E;&#x8FDB;&#x8FD9;&#x4E2A;&#x901A;&#x9053;:</p>
<figure class="highlight clojure"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name"><span class="builtin-name">let</span></span> [t (<span class="name">thread</span> <span class="string">&quot;chili&quot;</span>)]</span><br><span class="line">  (<span class="name">&lt;!!</span> t))</span><br><span class="line"><span class="comment">; =&gt; &quot;chili&quot;</span></span><br></pre></td></tr></table></figure>
<blockquote>
<p>In this case, the process doesn&#x2019;t wait for any events; instead, it stops immediately. Its return value is <code>&quot;chili&quot;</code>, which gets put on the channel that&#x2019;s bound to <code>t</code>. We take from <code>t</code>, returning <code>&quot;chili&quot;</code>.</p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;<code>thread</code>&#x521B;&#x5EFA;&#x7684;&#x8FC7;&#x7A0B;&#x7ACB;&#x5373;&#x8FD4;&#x56DE;&#x503C;<code>&quot;chili&quot;</code>,&#x8FD9;&#x4E2A;&#x503C;&#x88AB;&#x653E;&#x8FDB;&#x901A;&#x9053;<code>t</code>&#x3002;&#x6211;&#x4EEC;&#x4ECE;&#x901A;&#x9053;<code>t</code>&#x53D6;&#x5F97;<code>&quot;chili&quot;</code>&#x3002;</p>
<blockquote>
<p>The reason you should use <code>thread</code> instead of a go block when you&#x2019;re performing a long-running task is so you don&#x2019;t clog your thread pool. Imagine you&#x2019;re running four processes that download humongous files, save them, and then put the file paths on a channel. While the processes are downloading files and saving these files, Clojure can&#x2019;t park their threads. It can park the thread only at the last step, when the process puts the files&#x2019; paths on a channel. Therefore, if your thread pool has only four threads, all four threads will be used for downloading, and no other process will be allowed to run until one of the downloads finishes.</p>
</blockquote>
<p>&#x8FD0;&#x884C;&#x957F;&#x65F6;&#x95F4;&#x4EFB;&#x52A1;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;<code>thread</code>&#x800C;&#x4E0D;&#x662F;go blockd&#x7684;&#x7406;&#x7531;&#x662F;&#xFF1A;&#x8FD9;&#x4E48;&#x505A;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x7EBF;&#x7A0B;&#x6C60;&#x3002;&#x5047;&#x8BBE;&#x4F60;&#x6B63;&#x5728;&#x8FD0;&#x884C;4&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x90FD;&#x4E0B;&#x8F7D;&#x4E00;&#x4E2A;&#x5927;&#x6587;&#x4EF6;&#xFF0C;&#x4FDD;&#x5B58;&#x6587;&#x4EF6;&#xFF0C;&#x628A;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#x4E0A;&#x3002;&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x6B63;&#x5728;&#x4E0B;&#x8F7D;&#x548C;&#x4FDD;&#x5B58;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;Clojure&#x4E0D;&#x80FD;&#x505C;&#x6CCA;&#x5B83;&#x4EEC;&#x7684;&#x7EBF;&#x7A0B;&#x3002;&#x53EA;&#x6709;&#x5230;&#x6700;&#x540E;&#x4E00;&#x6B65;&#xFF0C;&#x8FC7;&#x7A0B;&#x628A;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x653E;&#x8FDB;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#x65F6;&#xFF0C;Clojure&#x624D;&#x80FD;&#x505C;&#x6CCA;&#x5B83;&#x4EEC;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7EBF;&#x7A0B;&#x6C60;&#x53EA;&#x6709;4&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x90FD;&#x4F1A;&#x88AB;&#x4E0B;&#x8F7D;&#x5360;&#x7528;&#xFF0C;&#x5176;&#x4ED6;&#x8FC7;&#x7A0B;&#x90FD;&#x65E0;&#x6CD5;&#x8FD0;&#x884C;&#xFF0C;&#x76F4;&#x5230;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x4E0B;&#x8F7D;&#x7ED3;&#x675F;&#x3002;</p>
<blockquote>
<p><code>go</code>, <code>thread</code>, <code>chan</code>, <code>&lt;!</code>, <code>&lt;!!</code>, <code>&gt;!</code>, and <code>&gt;!!</code> are the core tools you&#x2019;ll use for creating and communicating with processes. Both put and take will cause a process to wait until its complement is performed on the given channel. <code>go</code> allows you to use the parking variants of put and take, which could improve performance. You should use the blocking variants, along with <code>thread</code>, if you&#x2019;re performing long-running tasks before the put or take.</p>
</blockquote>
<p><code>go</code>, <code>thread</code>, <code>chan</code>, <code>&lt;!</code>, <code>&lt;!!</code>, <code>&gt;!</code>, &#x548C; <code>&gt;!!</code>&#x662F;&#x8FC7;&#x7A0B;&#x521B;&#x5EFA;&#x548C;&#x901A;&#x4FE1;&#x7684;&#x6838;&#x5FC3;&#x5DE5;&#x5177;&#x3002;&#x653E;&#x8FDB;&#x548C;&#x53D6;&#x5F97;&#x90FD;&#x4F1A;&#x4F7F;&#x8FC7;&#x7A0B;&#x7B49;&#x5F85;&#xFF0C;&#x76F4;&#x5230;&#x901A;&#x9053;&#x4E0A;&#x6709;&#x4E92;&#x8865;&#x64CD;&#x4F5C;&#x3002;<code>go</code>&#x91CC;&#x9762;&#x5141;&#x8BB8;&#x4F60;&#x4F7F;&#x7528;&#x653E;&#x8FDB;&#x548C;&#x53D6;&#x5F97;&#x7684;&#x505C;&#x6CCA;&#x53D8;&#x4F53;&#xFF0C;&#x4EE5;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x3002;&#x5982;&#x679C;&#x653E;&#x8FDB;&#x6216;&#x53D6;&#x5F97;&#x524D;&#xFF0C;&#x8981;&#x6267;&#x884C;&#x957F;&#x65F6;&#x95F4;&#x4EFB;&#x52A1;&#xFF0C;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x963B;&#x585E;&#x53D8;&#x4F53;&#x52A0;&#x4E0A;<code>thread</code>&#x3002;</p>
<blockquote>
<p>And that should give you everything you need to fulfill your heart&#x2019;s desire and create a machine that turns money into hot dogs.</p>
</blockquote>
<p>&#x5C31;&#x8FD9;&#x4E9B;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x8FD9;&#x4E9B;&#x521B;&#x5EFA;&#x70ED;&#x72D7;&#x8D29;&#x5356;&#x673A;&#x4E86;&#x3002;</p>
<blockquote>
<p>The Hot Dog Machine Process You&#x2019;ve Been Longing For</p>
</blockquote>
<h2 id="&#x4F60;&#x6E34;&#x671B;&#x7684;&#x70ED;&#x72D7;&#x673A;"><a href="#&#x4F60;&#x6E34;&#x671B;&#x7684;&#x70ED;&#x72D7;&#x673A;" class="headerlink" title="&#x4F60;&#x6E34;&#x671B;&#x7684;&#x70ED;&#x72D7;&#x673A;"></a>&#x4F60;&#x6E34;&#x671B;&#x7684;&#x70ED;&#x72D7;&#x673A;</h2><blockquote>
<p>Behold, your dreams made real!</p>
</blockquote>
<p>&#x770B;&#xFF0C;&#x4F60;&#x68A6;&#x60F3;&#x6210;&#x771F;&#x4E86;&#xFF01;</p>
<figure class="highlight clojure"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name"><span class="builtin-name">defn</span></span> hot-dog-machine</span><br><span class="line">  []</span><br><span class="line">  (<span class="name"><span class="builtin-name">let</span></span> [in (<span class="name">chan</span>)</span><br><span class="line">        out (<span class="name">chan</span>)]</span><br><span class="line">    (<span class="name">go</span> (<span class="name">&lt;!</span> in)</span><br><span class="line">        (<span class="name">&gt;!</span> out <span class="string">&quot;hot dog&quot;</span>))</span><br><span class="line">    [in out]))</span><br></pre></td></tr></table></figure>
<blockquote>
<p>This function creates an <code>in</code> channel for receiving money and an <code>out</code> channel for dispensing a hot dog. It then creates an asynchronous process with <code>go</code>, which waits for money and then dispenses a hot dog. Finally, it returns the <code>in</code> and <code>out</code> channels as a vector.</p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;<code>in</code>&#x901A;&#x9053;&#xFF0C;&#x7528;&#x4E8E;&#x6536;&#x94B1;&#xFF0C;&#x4E00;&#x4E2A;<code>out</code>&#x901A;&#x9053;&#x7528;&#x4E8E;&#x7ED9;&#x51FA;&#x70ED;&#x72D7;&#x3002;&#x7136;&#x540E;&#x7528;<code>go</code>&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x8FC7;&#x7A0B;&#xFF0C;&#x7B49;&#x7740;&#x6536;&#x94B1;&#xFF0C;&#x7136;&#x540E;&#x653E;&#x51FA;&#x70ED;&#x72D7;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x628A;<code>in</code>&#x548C;<code>out</code>&#x653E;&#x5728;&#x4E00;&#x4E2A;vector&#x91CC;&#x8FD4;&#x56DE;&#x3002;</p>
<blockquote>
<p>Time for a hot dog!</p>
</blockquote>
<p>&#x70ED;&#x72D7;&#x4EA4;&#x6613;:</p>
<figure class="highlight clojure"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name"><span class="builtin-name">let</span></span> [[in out] (<span class="name">hot-dog-machine</span>)]</span><br><span class="line">  (<span class="name">&gt;!!</span> in <span class="string">&quot;pocket lint&quot;</span>)</span><br><span class="line">  (<span class="name">&lt;!!</span> out))</span><br><span class="line"><span class="comment">; =&gt; &quot;hot dog&quot;</span></span><br></pre></td></tr></table></figure>
<blockquote>
<p>In this snippet, you use destructuring (covered in Chapter 3) with <code>let</code> to bind the <code>in</code> and <code>out</code> channels to the <code>in</code> and <code>out</code> symbols. You then put <code>&quot;pocket lint&quot;</code> on the <code>in</code> channel. The hot dog machine process waits for something, anything, to arrive on the <code>in</code> channel; once <code>&quot;pocket lint&quot;</code> arrives, the hot dog machine process resumes execution, putting <code>&quot;hot dog&quot;</code> on the <code>out</code> channel.</p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x7528;&#x89E3;&#x6784;(&#x7B2C;3&#x7AE0;&#x8BB2;&#x89E3;&#x8FC7;)&#x628A;<code>in</code>&#x548C;<code>out</code>&#x901A;&#x9053;&#x7ED1;&#x5B9A;&#x5230;<code>in</code>&#x548C;<code>out</code>&#x7B26;&#x53F7;&#x3002;&#x7136;&#x540E;&#x628A;<code>&quot;pocket lint&quot;</code>&#x653E;&#x8FDB;<code>in</code>&#x901A;&#x9053;&#x3002;&#x70ED;&#x72D7;&#x673A;&#x8FC7;&#x7A0B;&#x6B63;&#x5728;&#x7B49;&#x5F85;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x8FDB;&#x5165;<code>in</code>&#x901A;&#x9053;&#xFF0C;&#x4E00;&#x65E6;<code>&quot;pocket lint&quot;</code>&#x5230;&#x8FBE;&#xFF0C;&#x70ED;&#x72D7;&#x673A;&#x8FC7;&#x7A0B;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF0C;&#x628A;<code>&quot;hot dog&quot;</code>&#x653E;&#x8FDB;<code>out</code>&#x901A;&#x9053;&#x3002;</p>
<blockquote>
<p>Wait a minute . . . that&#x2019;s not right. I mean, yay, free hot dogs, but someone&#x2019;s bound to get upset that the machine&#x2019;s accepting pocket lint as payment. Not only that, but this machine will only dispense one hot dog before shutting down. Let&#x2019;s alter the hot dog machine function so that you can specify how many hot dogs it has and so it only dispenses a hot dog when you give it the number 3:</p>
</blockquote>
<p>&#x7B49;&#x4E0B;&#xFF0C;&#x4E0D;&#x5BF9;&#x3002;&#x514D;&#x8D39;&#x70ED;&#x72D7;&#xFF0C;&#x70ED;&#x72D7;&#x673A;&#x63A5;&#x53D7;&#x4E86;&#x53E3;&#x888B;&#x91CC;&#x7684;&#x7ED2;&#x6BDB;&#x4F5C;&#x4E3A;&#x4ED8;&#x6B3E;&#x3002;&#x8FD8;&#x6709;&#xFF0C;&#x8FD9;&#x4E2A;&#x673A;&#x5668;&#x53EA;&#x80FD;&#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x70ED;&#x72D7;&#x3002;&#x4FEE;&#x6539;&#x4E00;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x5B83;&#x6709;&#x51E0;&#x4E2A;&#x70ED;&#x72D7;&#xFF0C;&#x5E76;&#x8BA9;&#x5B83;&#x53EA;&#x6709;&#x63A5;&#x53D7;&#x6570;&#x5B57;3&#x65F6;&#x5019;&#x624D;&#x53D1;&#x51FA;&#x70ED;&#x72D7;:</p>
<figure class="highlight clojure"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name"><span class="builtin-name">defn</span></span> hot-dog-machine-v2</span><br><span class="line">  [hot-dog-count]</span><br><span class="line">  (<span class="name"><span class="builtin-name">let</span></span> [in (<span class="name">chan</span>)</span><br><span class="line">        out (<span class="name">chan</span>)]</span><br><span class="line">    (<span class="name">go</span> (<span class="name"><span class="builtin-name">loop</span></span> [hc hot-dog-count]</span><br><span class="line">          (<span class="name"><span class="builtin-name">if</span></span> (<span class="name"><span class="builtin-name">&gt;</span></span> hc <span class="number">0</span>)</span><br><span class="line">            (<span class="name"><span class="builtin-name">let</span></span> [input (<span class="name">&lt;!</span> in)]</span><br><span class="line">             &#x278A;(<span class="name"><span class="builtin-name">if</span></span> (<span class="name"><span class="builtin-name">=</span></span> <span class="number">3</span> input)</span><br><span class="line">                (<span class="name"><span class="builtin-name">do</span></span> (<span class="name">&gt;!</span> out <span class="string">&quot;hot dog&quot;</span>)</span><br><span class="line">                    (<span class="name"><span class="builtin-name">recur</span></span> (<span class="name"><span class="builtin-name">dec</span></span> hc)))</span><br><span class="line">                (<span class="name"><span class="builtin-name">do</span></span> (<span class="name">&gt;!</span> out <span class="string">&quot;wilted lettuce&quot;</span>)</span><br><span class="line">                    (<span class="name"><span class="builtin-name">recur</span></span> hc))))</span><br><span class="line">           &#x278B;(<span class="name"><span class="builtin-name">do</span></span> (<span class="name">close!</span> in)</span><br><span class="line">                (<span class="name">close!</span> out)))))</span><br><span class="line">    [in out]))</span><br></pre></td></tr></table></figure>
<blockquote>
<p>There&#x2019;s a lot more code here, but the strategy is straightforward. The new function <code>hot-dog-machine-v2</code> allows you to specify the <code>hot-dog-count</code>. Within the go block at &#x278A;, it dispenses a hot dog only if the number 3 (meaning three dollars) is placed on the <code>in</code> channel; otherwise, it dispenses wilted lettuce, which is definitely not a hot dog. Once a process has taken the output, the hot dog machine process loops back with an updated hot dog count and is ready to receive money again.</p>
</blockquote>
<p>&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x867D;&#x7136;&#x591A;&#xFF0C;&#x4F46;&#x5F88;&#x76F4;&#x63A5;&#x3002;&#x51FD;&#x6570;<code>hot-dog-machine-v2</code>&#x5141;&#x8BB8;&#x4F60;&#x6307;&#x5B9A;<code>hot-dog-count</code>&#x3002;&#x5728;&#x278A;&#x5904;&#x7684;go block&#x5185;&#xFF0C;&#x53EA;&#x6709;&#x6570;&#x5B57;3(&#x610F;&#x601D;&#x662F;3&#x7F8E;&#x5143;)&#x653E;&#x5165;&#x901A;&#x9053;<code>in</code>&#xFF0C;&#x624D;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x70ED;&#x72D7;&#xFF0C;&#x5426;&#x5219;&#x7ED9;&#x51FA;&#x67AF;&#x840E;&#x7684;&#x83B4;&#x82E3;&#x3002;&#x4E00;&#x65E6;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x53D6;&#x8D70;&#x4E86;&#x7ED9;&#x51FA;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x70ED;&#x72D7;&#x673A;&#x8FC7;&#x7A0B;&#x66F4;&#x65B0;&#x70ED;&#x72D7;&#x8BA1;&#x6570;&#xFF0C;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x5FAA;&#x73AF;&#xFF0C;&#x51C6;&#x5907;&#x597D;&#x6536;&#x94B1;&#x3002;</p>
<blockquote>
<p>When the machine process runs out of hot dogs, the process closes the channels at &#x278B;. When you close a channel, you can no longer perform puts on it, and once you&#x2019;ve taken all values off a closed channel, any subsequent takes will return <code>nil</code>.</p>
</blockquote>
<p>&#x5F53;&#x70ED;&#x72D7;&#x673A;&#x8FC7;&#x7A0B;&#x7528;&#x5B8C;&#x70ED;&#x72D7;&#xFF0C;&#x8FC7;&#x7A0B;&#x5728;&#x278B;&#x5904;&#x5173;&#x95ED;&#x901A;&#x9053;&#xFF0C;&#x901A;&#x9053;&#x5173;&#x95ED;&#x540E;&#xFF0C;&#x4E0D;&#x80FD;&#x5728;&#x6267;&#x884C;&#x653E;&#x5165;&#x64CD;&#x4F5C;&#xFF0C;&#x4E00;&#x65E6;&#x901A;&#x9053;&#x4E0A;&#x7684;&#x503C;&#x90FD;&#x88AB;&#x53D6;&#x8D70;&#xFF0C;&#x540E;&#x7EED;&#x7684;&#x53D6;&#x5F97;&#x64CD;&#x4F5C;&#x5C06;&#x8FD4;&#x56DE;<code>nil</code>&#x3002;</p>
<blockquote>
<p>Let&#x2019;s give the upgraded hot dog machine a go in Listing 11-1 by putting in money and pocket lint:</p>
</blockquote>
<p>&#x4F7F;&#x7528;&#x4E00;&#x4E0B;&#x5347;&#x7EA7;&#x7684;&#x70ED;&#x72D7;&#x673A;&#xFF0C;&#x653E;&#x8FDB;&#x94B1;&#x548C;&#x7ED2;&#x6BDB;:</p>
<p>list 11-1:</p>
<figure class="highlight clojure"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name"><span class="builtin-name">let</span></span> [[in out] (<span class="name">hot-dog-machine-v2</span> <span class="number">2</span>)]</span><br><span class="line">  (<span class="name">&gt;!!</span> in <span class="string">&quot;pocket lint&quot;</span>)</span><br><span class="line">  (<span class="name">println</span> (<span class="name">&lt;!!</span> out))</span><br><span class="line"></span><br><span class="line">  (<span class="name">&gt;!!</span> in <span class="number">3</span>)</span><br><span class="line">  (<span class="name">println</span> (<span class="name">&lt;!!</span> out))</span><br><span class="line"></span><br><span class="line">  (<span class="name">&gt;!!</span> in <span class="number">3</span>)</span><br><span class="line">  (<span class="name">println</span> (<span class="name">&lt;!!</span> out))</span><br><span class="line"></span><br><span class="line">  (<span class="name">&gt;!!</span> in <span class="number">3</span>)</span><br><span class="line">  (<span class="name">&lt;!!</span> out))</span><br><span class="line"><span class="comment">; =&gt; wilted lettuce</span></span><br><span class="line"><span class="comment">; =&gt; hotdog</span></span><br><span class="line"><span class="comment">; =&gt; hotdog</span></span><br><span class="line"><span class="comment">; =&gt; nil</span></span><br></pre></td></tr></table></figure>
<blockquote>
<p>First, we try the ol&#x2019; pocket lint trick and get wilted lettuce. Next, we put in 3 dollars twice and get a hot dog both times. Then, we try to put in another 3 dollars, but that&#x2019;s ignored because the channel is closed; the number 3 is not put on the channel. When we try to take from the <code>out</code> channel, we get <code>nil</code>, again because the channel is closed. You might notice a couple of interesting details about <code>hot-dog-machine-v2</code>. First, it does a put and a take within the same go block. This isn&#x2019;t that unusual, and it&#x2019;s one way you can create a <em>pipeline</em> of processes: just make the <em>in</em> channel of one process the <em>out</em> channel of another. The following example does just that, passing a string through a series of processes that perform transformations until the string finally gets printed by the last process:</p>
</blockquote>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x4E86;&#x7ED2;&#x6BDB;&#x628A;&#x620F;&#xFF0C;&#x5F97;&#x5230;&#x4E86;&#x67AF;&#x840E;&#x83B4;&#x82E3;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x653E;&#x5165;&#x4E24;&#x6B21;3&#x7F8E;&#x5143;&#xFF0C;&#x6BCF;&#x6B21;&#x90FD;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x70ED;&#x72D7;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x518D;&#x6B21;&#x653E;&#x5165;3&#x7F8E;&#x5143;,&#x4F46;&#x88AB;&#x5FFD;&#x7565;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x901A;&#x9053;&#x5173;&#x4E86;&#xFF0C;3&#x7F8E;&#x5143;&#x6CA1;&#x6709;&#x653E;&#x5165;&#x901A;&#x9053;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x5728;<code>out</code>&#x901A;&#x9053;&#x8FDB;&#x884C;&#x53D6;&#x5F97;&#x64CD;&#x4F5C;&#xFF0C;&#x5F97;&#x5230;&#x4E86;<code>nil</code>,&#x56E0;&#x4E3A;&#x901A;&#x9053;&#x5DF2;&#x7ECF;&#x5173;&#x95ED;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x6CE8;&#x610F;&#x5230;<code>hot-dog-machine-v2</code>&#x91CC;&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x4E2A;go block&#x91CC;&#x8FDB;&#x884C;&#x4E86;&#x653E;&#x8FDB;&#x548C;&#x53D6;&#x5F97;&#x3002;&#x8FD9;&#x5F88;&#x5E38;&#x89C1;&#xFF0C;&#x8FD9;&#x662F;&#x521B;&#x5EFA;&#x8FC7;&#x7A0B;<em>&#x7BA1;&#x9053;</em>&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;:&#x53EA;&#x9700;&#x8BA9;<em>in</em>&#x901A;&#x9053;&#x5229;&#x7528;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;<em>out</em> &#x901A;&#x9053;&#x5229;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;&#x4E0B;&#x9762;&#x4F8B;&#x5B50;&#x5E72;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#xFF0C;&#x8BA9;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x901A;&#x8FC7;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x8F6C;&#x6362;&#x5904;&#x7406;&#xFF0C;&#x76F4;&#x5230;&#x88AB;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x6253;&#x5370;:</p>
<figure class="highlight clojure"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name"><span class="builtin-name">let</span></span> [c1 (<span class="name">chan</span>)</span><br><span class="line">      c2 (<span class="name">chan</span>)</span><br><span class="line">      c3 (<span class="name">chan</span>)]</span><br><span class="line">  (<span class="name">go</span> (<span class="name">&gt;!</span> c2 (<span class="name">clojure.string/upper-case</span> (<span class="name">&lt;!</span> c1))))</span><br><span class="line">  (<span class="name">go</span> (<span class="name">&gt;!</span> c3 (<span class="name">clojure.string/reverse</span> (<span class="name">&lt;!</span> c2))))</span><br><span class="line">  (<span class="name">go</span> (<span class="name">println</span> (<span class="name">&lt;!</span> c3)))</span><br><span class="line">  (<span class="name">&gt;!!</span> c1 <span class="string">&quot;redrum&quot;</span>))</span><br><span class="line"><span class="comment">; =&gt; MURDER</span></span><br></pre></td></tr></table></figure>
<blockquote>
<p>I&#x2019;ll have more to say about process pipelines and how you can use them instead of callbacks toward the end of the chapter.</p>
</blockquote>
<p>&#x8FC7;&#x7A0B;&#x7BA1;&#x9053;&#x5148;&#x8BF4;&#x5230;&#x8FD9;&#xFF0C;&#x540E;&#x9762;&#x518D;&#x63A5;&#x7740;&#x8BF4;&#x5982;&#x4F55;&#x7528;&#x5B83;&#x66FF;&#x4EE3;&#x56DE;&#x8C03;&#x3002;</p>
<blockquote>
<p>Back to Listing 11-1! Another thing to note is that the hot dog machine doesn&#x2019;t accept more money until you&#x2019;ve dealt with whatever it&#x2019;s dispensed. This allows you to model state-machine-like behavior, where the completion of channel operations triggers state transitions. For example, you can think of the vending machine as having two states: <em>ready to receive money</em> and <em>dispensed item</em>. Inserting money and taking the item trigger transitions between the two.</p>
</blockquote>
<p>&#x56DE;&#x5230;list 11-1,&#x53E6;&#x4E00;&#x4E2A;&#x6CE8;&#x610F;&#x6CE8;&#x610F;&#x7684;&#x662F;: &#x70ED;&#x72D7;&#x673A;&#x4E0D;&#x4F1A;&#x518D;&#x6536;&#x94B1;&#xFF0C;&#x76F4;&#x5230;&#x4F60;&#x5904;&#x7406;&#x4E86;&#x5B83;&#x7ED9;&#x51FA;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x8FD9;&#x8BA9;&#x4F60;&#x80FD;&#x5BF9;&#x7C7B;&#x4F3C;&#x72B6;&#x6001;&#x673A;&#x7684;&#x884C;&#x4E3A;&#x5EFA;&#x7ACB;&#x6A21;&#x578B;&#xFF0C;&#x4E92;&#x8865;&#x7684;&#x901A;&#x9053;&#x64CD;&#x4F5C;&#x89E6;&#x53D1;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x8D29;&#x5356;&#x673A;&#x6709;&#x4E24;&#x79CD;&#x72B6;&#x6001;: <em>&#x51C6;&#x5907;&#x6536;&#x94B1;</em> &#x548C; <em>&#x7ED9;&#x51FA;&#x4E86;&#x7269;&#x54C1;</em>&#x3002;&#x653E;&#x8FDB;&#x94B1;&#x548C;&#x62FF;&#x8D70;&#x7269;&#x54C1;&#x89E6;&#x53D1;&#x72B6;&#x6001;&#x95F4;&#x7684;&#x8F6C;&#x6362;&#x3002;</p>
<blockquote>
<p>alts!!</p>
</blockquote>
<h2 id="alts"><a href="#alts" class="headerlink" title="alts!!"></a>alts!!</h2><blockquote>
<p>The core.async function <code>alts!!</code> lets you use the result of the first successful channel operation among a collection of operations. We did something similar to this with delays and futures in &#x201C;Delays&#x201D; on page 198. In that example, we uploaded a set of headshots to a headshot-sharing site and notified the headshot owner when the first photo was uploaded. Here&#x2019;s how you&#x2019;d do the same with <code>alts!!</code>:</p>
</blockquote>
<p>core.async&#x7684;<code>alts!!</code>&#x51FD;&#x6570;&#x5141;&#x8BB8;&#x4F60;&#x4F7F;&#x7528;&#x64CD;&#x4F5C;&#x96C6;&#x5408;&#x91CC;&#x7B2C;&#x4E00;&#x4E2A;&#x6210;&#x529F;&#x7684;&#x901A;&#x9053;&#x64CD;&#x4F5C;&#x7ED3;&#x679C;&#x3002;&#x6211;&#x4EEC;&#x7528;&#x5EF6;&#x671F;&#x548C;&#x672A;&#x6765;&#x5728;198&#x9875;&#x505A;&#x4E86;&#x7C7B;&#x4F3C;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x90A3;&#x4E2A;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4E0A;&#x4F20;&#x4E00;&#x7EC4;&#x7167;&#x7247;&#x5230;&#x7167;&#x7247;&#x5171;&#x4EAB;&#x7F51;&#x7AD9;&#xFF0C;&#x5E76;&#x4E14;&#x5F53;&#x7B2C;&#x4E00;&#x5F20;&#x4E0A;&#x4F20;&#x5B8C;&#x6210;&#x65F6;&#xFF0C;&#x901A;&#x77E5;&#x4E0A;&#x4F20;&#x4EBA;&#xFF08;<a href="https://morrxy.github.io/2016/07/15/braveclojure-concurrency/#&#x5EF6;&#x671F;" target="_blank" rel="external">&#x70B9;&#x51FB;&#x67E5;&#x770B;</a>&#xFF09;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x7528;<code>alts!!</code>&#x505A;&#x540C;&#x6837;&#x7684;&#x4E8B;&#x60C5;:</p>
<figure class="highlight"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br></pre></td><td class="code"><pre><span class="line">(defn upload</span><br><span class="line">  [headshot c]</span><br><span class="line">  (go (Thread/sleep (rand 100))</span><br><span class="line">      (&gt;! c headshot)))</span><br><span class="line"></span><br><span class="line">&#x278A; (let [c1 (chan)</span><br><span class="line">      c2 (chan)</span><br><span class="line">      c3 (chan)]</span><br><span class="line">  (upload &quot;serious.jpg&quot; c1)</span><br><span class="line">  (upload &quot;fun.jpg&quot; c2)</span><br><span class="line">  (upload &quot;sassy.jpg&quot; c3)</span><br><span class="line">&#x278B;   (let [[headshot channel] (alts!! [c1 c2 c3])]</span><br><span class="line">    (println &quot;Sending headshot notification for&quot; headshot)))</span><br><span class="line">; =&gt; Sending headshot notification for sassy.jpg</span><br></pre></td></tr></table></figure>
<blockquote>
<p>Here, the <code>upload</code> function takes a headshot and a channel, and creates a new process that sleeps for a random amount of time (to simulate the upload) and then puts the headshot on the channel. The <code>let</code> bindings and <code>upload</code> function calls beginning at &#x278A; should make sense: we create three channels and then use them to perform the uploads.</p>
</blockquote>
<p><code>upload</code>&#x51FD;&#x6570;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x7167;&#x7247;&#x548C;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x5E76;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x8FC7;&#x7A0B;&#xFF0C;&#x7761;&#x7720;&#x968F;&#x673A;&#x65F6;&#x95F4;(&#x6A21;&#x62DF;&#x4E0A;&#x4F20;)&#xFF0C;&#x7136;&#x540E;&#x628A;&#x7167;&#x7247;&#x653E;&#x8FDB;&#x8FD9;&#x4E2A;&#x901A;&#x9053;&#x3002;&#x5728;&#x278A;&#x5904;&#xFF0C;&#x521B;&#x5EFA;&#x4E86;3&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x5E76;&#x7528;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x4E0A;&#x4F20;&#x3002;</p>
<blockquote>
<p>Things get interesting at &#x278B;. The <code>alts!!</code> function takes a vector of channels as its argument. This is like saying, &#x201C;Try to do a blocking take on each of these channels simultaneously. As soon as a take succeeds, return a vector whose first element is the value taken and whose second element is the winning channel.&#x201D; In this case, the channel associated with <em>sassy.jpg</em> received a value first. The other channels are still available if you want to take their values and do something with them. All <code>alts!!</code> does is take a value from the first channel to have a value; it doesn&#x2019;t touch the other channels.</p>
</blockquote>
<p>&#x5728;&#x278B;&#x5904;&#xFF0C;&#x4E8B;&#x60C5;&#x53D8;&#x7684;&#x6709;&#x610F;&#x601D;&#x4E86;&#x3002;<code>alts!!</code>&#x51FD;&#x6570;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x6210;&#x5458;&#x662F;&#x901A;&#x9053;&#x7684;vector&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x3002;&#x5C31;&#x50CF;&#x662F;&#x5728;&#x8BF4;&#xFF1A;&#x201D;&#x540C;&#x65F6;&#x5728;&#x6BCF;&#x4E2A;&#x901A;&#x9053;&#x4E0A;&#x5C1D;&#x8BD5;&#x963B;&#x585E;&#x53D6;&#x5F97;&#xFF0C;&#x4E00;&#x65E6;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6210;&#x529F;&#xFF0C;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;vector,&#x7B2C;&#x4E00;&#x4E2A;&#x6210;&#x5458;&#x662F;&#x53D6;&#x5F97;&#x7684;&#x503C;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x5BF9;&#x5E94;&#x7684;&#x901A;&#x9053;&#x201D;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;&#x4E0E;<em>sassy.jpg</em>&#x76F8;&#x5173;&#x7684;&#x901A;&#x9053;&#x7B2C;&#x4E00;&#x4E2A;&#x63A5;&#x53D7;&#x5230;&#x4E86;&#x503C;&#x3002;&#x5176;&#x4ED6;&#x901A;&#x9053;&#x7684;&#x503C;&#x4ECD;&#x7136;&#x53EF;&#x7528;&#x3002;<code>alts!!</code>&#x505A;&#x7684;&#x5C31;&#x662F;&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x6709;&#x503C;&#x7684;&#x901A;&#x9053;&#x53D6;&#x5F97;&#x503C;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x78B0;&#x5176;&#x4ED6;&#x901A;&#x9053;&#x3002;</p>
<blockquote>
<p>One cool aspect of <code>alts!!</code> is that you can give it a <em>timeout channel</em>, which waits the specified number of milliseconds and then closes. It&#x2019;s an elegant mechanism for putting a time limit on concurrent operations. Here&#x2019;s how you could use it with the upload service:</p>
</blockquote>
<p><code>alts!!</code>&#x5F88;cool&#x7684;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x662F;&#xFF1A;&#x53EF;&#x4EE5;&#x7ED9;&#x5B83;&#x4E00;&#x4E2A;<em>&#x8D85;&#x65F6;&#x901A;&#x9053;</em>&#xFF0C;&#x8FD9;&#x4E2A;&#x901A;&#x9053;&#x7B49;&#x5F85;&#x6307;&#x5B9A;&#x6BEB;&#x79D2;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x5173;&#x95ED;&#x3002;&#x8FD9;&#x662F;&#x4E2A;&#x4F18;&#x96C5;&#x7684;&#x5E76;&#x53D1;&#x64CD;&#x4F5C;&#x9650;&#x65F6;&#x673A;&#x5236;&#x3002;&#x4EE3;&#x7801;&#x5982;&#x4E0B;:</p>
<figure class="highlight clojure"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name"><span class="builtin-name">let</span></span> [c1 (<span class="name">chan</span>)]</span><br><span class="line">  (<span class="name">upload</span> <span class="string">&quot;serious.jpg&quot;</span> c1)</span><br><span class="line">  (<span class="name"><span class="builtin-name">let</span></span> [[headshot channel] (<span class="name">alts!!</span> [c1 (<span class="name">timeout</span> <span class="number">20</span>)])]</span><br><span class="line">    (<span class="name"><span class="builtin-name">if</span></span> headshot</span><br><span class="line">      (<span class="name">println</span> <span class="string">&quot;Sending headshot notification for&quot;</span> headshot)</span><br><span class="line">      (<span class="name">println</span> <span class="string">&quot;Timed out!&quot;</span>))))</span><br><span class="line"><span class="comment">; =&gt; Timed out!</span></span><br></pre></td></tr></table></figure>
<blockquote>
<p>In this case, we set the timeout to 20 milliseconds. Because the upload didn&#x2019;t finish in that time frame, we got a timeout message.</p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;&#x8BBE;&#x7F6E;&#x4E86;20&#x6BEB;&#x79D2;&#x7684;&#x8D85;&#x65F6;&#x3002;&#x56E0;&#x4E3A;&#x4E0A;&#x4F20;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x9650;&#x5185;&#x6CA1;&#x5B8C;&#x6210;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x4E86;&#x8D85;&#x65F6;&#x4FE1;&#x606F;&#x3002;</p>
<blockquote>
<p>You can also use <code>alts!!</code> to specify put operations. To do that, place a vector inside the vector you pass to <code>alts!!</code>, like at &#x278A; in this example:</p>
</blockquote>
<p><code>alts</code>&#x91CC;&#x4E5F;&#x53EF;&#x4EE5;&#x505A;&#x653E;&#x8FDB;&#x64CD;&#x4F5C;&#x3002;<code>alts</code>&#x7684;vector&#x53C2;&#x6570;&#x91CC;&#xFF0C;&#x7528;&#x4E00;&#x4E2A;vector&#x8868;&#x793A;&#x653E;&#x8FDB;&#x64CD;&#x4F5C;:</p>
<figure class="highlight clojure"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name"><span class="builtin-name">let</span></span> [c1 (<span class="name">chan</span>)</span><br><span class="line">      c2 (<span class="name">chan</span>)]</span><br><span class="line">  (<span class="name">go</span> (<span class="name">&lt;!</span> c2))</span><br><span class="line">   (<span class="name"><span class="builtin-name">let</span></span> [[value channel] (<span class="name">alts!!</span> [c1 [c2 <span class="string">&quot;put!&quot;</span>]])]</span><br><span class="line">    (<span class="name">println</span> value)</span><br><span class="line">    (<span class="name"><span class="builtin-name">=</span></span> channel c2)))</span><br><span class="line"><span class="comment">; =&gt; true</span></span><br><span class="line"><span class="comment">; =&gt; true</span></span><br></pre></td></tr></table></figure>
<blockquote>
<p>Here you&#x2019;re creating two channels and then creating a process that&#x2019;s waiting to perform a take on <code>c2</code>. The vector that you supply to <code>alts!!</code> tells it, &#x201C;Try to do a take on <code>c1</code> and try to put &#x201C;put!&#x201D; on <code>c2</code>. If the take on <code>c1</code> finishes first, return its value and channel. If the put on <code>c2</code> finishes first, return <code>true</code> if the put was successful and <code>false</code> otherwise.&#x201D; Finally, the result of <code>value</code> (which is <code>true</code>, because the <code>c2</code> channel was open) prints and shows that the channel returned was indeed <code>c2</code>.</p>
</blockquote>
<p>&#x4EE3;&#x7801;&#x91CC;&#x521B;&#x5EFA;&#x4E86;&#x4E24;&#x4E2A;&#x901A;&#x9053;&#xFF0C;&#x7136;&#x540E;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x7B49;&#x7740;&#x5728;<code>c2</code>&#x4E0A;&#x8FDB;&#x884C;&#x53D6;&#x5F97;&#x64CD;&#x4F5C;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x4F20;&#x7ED9;<code>alts!!</code>&#x7684;vector&#x53C2;&#x6570;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF1A;&#x201C;&#x5C1D;&#x8BD5;&#x5728;<code>c1</code>&#x4E0A;&#x8FDB;&#x884C;&#x53D6;&#x5F97;&#xFF0C;&#x5E76;&#x4E14;&#x5C1D;&#x8BD5;&#x5728;<code>c2</code>&#x4E0A;&#x653E;&#x8FDB;&#x201D;put!&#x201D;&#x3002;&#x5982;&#x679C;<code>c1</code>&#x4E0A;&#x7684;&#x53D6;&#x5F97;&#x7B2C;&#x4E00;&#x4E2A;&#x5B8C;&#x6210;&#xFF0C;&#x8FD4;&#x56DE;&#x90A3;&#x4E2A;&#x503C;&#x548C;&#x901A;&#x9053;&#x3002;&#x5982;&#x679C;<code>c2</code>&#x4E0A;&#x7684;&#x653E;&#x8FDB;&#x5148;&#x5B8C;&#x6210;&#xFF0C;&#x653E;&#x8FDB;&#x6210;&#x529F;&#x5219;&#x8FD4;&#x56DE;<code>true</code>&#xFF0C;&#x5426;&#x5219;&#x8FD4;&#x56DE;<code>false</code>&#x201D;&#x3002;&#x6700;&#x540E;&#xFF0C;<code>value</code>&#x548C;<code>channel</code>&#x88AB;&#x6253;&#x5370;&#xFF0C;&#x8BC1;&#x5B9E;&#x8FD4;&#x56DE;&#x7684;&#x901A;&#x9053;&#x786E;&#x5B9E;&#x662F;<code>c2</code>&#x3002;</p>
<blockquote>
<p>Like <code>&lt;!!</code> and <code>&gt;!!</code>, <code>alts!!</code> has a parking alternative, <code>alts!</code>, which you can use inside go blocks. <code>alts!</code> is a nice way to exercise some choice over which of a group of channels you put or take from. It still performs puts and takes, so the same reasons to use the parking or blocking variation apply.</p>
</blockquote>
<p>&#x540C;<code>&lt;!!</code>&#x548C;<code>&gt;!!</code>&#x4E00;&#x6837;&#xFF0C;<code>alts!</code>&#x4E5F;&#x6709;&#x4E2A;&#x505C;&#x6CCA;&#x7248;&#x53D8;&#x4F53;&#xFF0C;<code>alts!</code>,&#x53EA;&#x80FD;&#x5728;go blocks&#x91CC;&#x4F7F;&#x7528;&#x3002;<code>alts!</code>&#x662F;&#x5728;&#x4E00;&#x7EC4;&#x901A;&#x9053;&#x91CC;&#x8FDB;&#x884C;&#x9009;&#x62E9;&#x7684;&#x597D;&#x65B9;&#x6CD5;&#x3002;&#x5B83;&#x4E5F;&#x6267;&#x884C;&#x653E;&#x8FDB;&#x548C;&#x53D6;&#x5F97;&#xFF0C;&#x6240;&#x4EE5;&#x524D;&#x9762;&#x8BB2;&#x8FC7;&#x7684;&#x4F55;&#x65F6;&#x4F7F;&#x7528;&#x505C;&#x6CCA;&#x6216;&#x963B;&#x585E;&#x7684;&#x7406;&#x7531;&#x540C;&#x6837;&#x9002;&#x7528;&#x3002;</p>
<blockquote>
<p>And that covers the core.async basics! The rest of the chapter explains two common patterns for coordinating processes.</p>
</blockquote>
<p>core.async&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x8BB2;&#x5B8C;&#x4E86;&#xFF01;&#x540E;&#x9762;&#x8BB2;&#x89E3;&#x4E24;&#x4E2A;&#x534F;&#x8C03;&#x8FC7;&#x7A0B;&#x7684;&#x901A;&#x7528;&#x6A21;&#x5F0F;&#x3002;</p>
<blockquote>
<p>Queues</p>
</blockquote>
<h2 id="&#x961F;&#x5217;"><a href="#&#x961F;&#x5217;" class="headerlink" title="&#x961F;&#x5217;"></a>&#x961F;&#x5217;</h2><blockquote>
<p>In &#x201C;Rolling Your Own Queue&#x201D; on page 202, you wrote a macro that let you queue futures. Processes let you use a similar technique in a more straightforward manner. Let&#x2019;s say you want to get a bunch of random quotes from a website and write them to a single file. You want to make sure that only one quote is written to a file at a time so the text doesn&#x2019;t get interleaved, so you put your quotes on a queue. Here&#x2019;s the full code:</p>
</blockquote>
<p>&#x5728;202&#x9875;&#x7684;&#x201D;&#x81EA;&#x5EFA;&#x961F;&#x5217;&#x201D;&#xFF0C;&#x4F60;&#x5199;&#x4E86;&#x5B8F;&#x628A;&#x672A;&#x6765;&#x961F;&#x5217;&#x5316;(<a href="https://morrxy.github.io/2016/07/15/braveclojure-concurrency/#&#x81EA;&#x5EFA;&#x961F;&#x5217;" target="_blank" rel="external">&#x70B9;&#x51FB;&#x67E5;&#x770B;</a>)&#x3002;&#x6709;&#x4E86;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F60;&#x80FD;&#x7528;&#x66F4;&#x76F4;&#x63A5;&#x7684;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;&#x7684;&#x6280;&#x5DE7;&#x3002;&#x5047;&#x8BBE;&#x4F60;&#x60F3;&#x4ECE;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x83B7;&#x5F97;&#x4E00;&#x4E9B;&#x968F;&#x673A;&#x7684;&#x540D;&#x8A00;&#xFF0C;&#x5E76;&#x5199;&#x8FDB;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x91CC;&#x3002;&#x4F60;&#x8981;&#x786E;&#x4FDD;&#x4E00;&#x6B21;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x540D;&#x8A00;&#x5199;&#x8FDB;&#x6587;&#x4EF6;&#x4EE5;&#x907F;&#x514D;&#x6587;&#x5B57;&#x4EA4;&#x53E0;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x4F60;&#x628A;&#x540D;&#x8A00;&#x653E;&#x8FDB;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#x3002;&#x8FD9;&#x662F;&#x5168;&#x90E8;&#x4EE3;&#x7801;:</p>
<figure class="highlight clojure"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name"><span class="builtin-name">defn</span></span> append-to-file</span><br><span class="line">  <span class="string">&quot;Write a string to the end of a file&quot;</span></span><br><span class="line">  [filename s]</span><br><span class="line">  (<span class="name">spit</span> filename s <span class="symbol">:append</span> <span class="literal">true</span>))</span><br><span class="line"></span><br><span class="line">(<span class="name"><span class="builtin-name">defn</span></span> format-quote</span><br><span class="line">  <span class="string">&quot;Delineate the beginning and end of a quote because it&apos;s convenient&quot;</span></span><br><span class="line">  [quote]</span><br><span class="line">  (<span class="name"><span class="builtin-name">str</span></span> <span class="string">&quot;=== BEGIN QUOTE ===\n&quot;</span> quote <span class="string">&quot;=== END QUOTE ===\n\n&quot;</span>))</span><br><span class="line"></span><br><span class="line">(<span class="name"><span class="builtin-name">defn</span></span> random-quote</span><br><span class="line">  <span class="string">&quot;Retrieve a random quote and format it&quot;</span></span><br><span class="line">  []</span><br><span class="line">  (<span class="name">format-quote</span> (<span class="name"><span class="builtin-name">slurp</span></span> <span class="string">&quot;http://www.braveclojure.com/random-quote&quot;</span>)))</span><br><span class="line"></span><br><span class="line">(<span class="name"><span class="builtin-name">defn</span></span> snag-quotes</span><br><span class="line">  [filename num-quotes]</span><br><span class="line">  (<span class="name"><span class="builtin-name">let</span></span> [c (<span class="name">chan</span>)]</span><br><span class="line">    (<span class="name">go</span> (<span class="name"><span class="builtin-name">while</span></span> <span class="literal">true</span> (<span class="name">append-to-file</span> filename (<span class="name">&lt;!</span> c))))</span><br><span class="line">    (<span class="name"><span class="builtin-name">dotimes</span></span> [n num-quotes] (<span class="name">go</span> (<span class="name">&gt;!</span> c (<span class="name">random-quote</span>))))))</span><br></pre></td></tr></table></figure>
<blockquote>
<p>The functions <code>append-to-file</code>, <code>format-quote</code>, and <code>random-quote</code> have docstrings that explain what they do. <code>snag-quotes</code> is where the interesting work happens. First, it creates a channel that&#x2019;s shared between the quote-producing processes and the quote-consuming process. Then it creates a process that uses <code>while true</code> to create an infinite loop. On every iteration of the loop, it waits for a quote to arrive on <code>c</code> and then appends it to a file. Finally, <code>snag-quotes</code> creates a <code>num-quotes</code> number of processes that fetch a quote and then put it on <code>c</code>. If you evaluate <code>(snag-quotes &quot;quotes&quot; 2)</code> and check the <em>quotes</em> file in the directory where you started your REPL, it should have two quotes:</p>
</blockquote>
<p>&#x51FD;&#x6570;<code>append-to-file</code>, <code>format-quote</code>, &#x548C; <code>random-quote</code>&#x90FD;&#x6709;&#x6587;&#x6863;&#x8BF4;&#x660E;&#x5404;&#x81EA;&#x7684;&#x529F;&#x80FD;&#x3002;&#x91CD;&#x70B9;&#x662F;<code>snag-quotes</code>&#x3002;&#x9996;&#x5148;&#x5B83;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x540D;&#x8A00;&#x751F;&#x4EA7;&#x8FC7;&#x7A0B;&#x548C;&#x540D;&#x8A00;&#x6D88;&#x8D39;&#x8FC7;&#x7A0B;&#x5171;&#x4EAB;&#x7684;&#x901A;&#x9053;&#x3002;&#x7136;&#x540E;&#x7528;<code>while true</code>&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x6BCF;&#x6B21;&#x5FAA;&#x73AF;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x90FD;&#x7B49;&#x5F85;&#x540D;&#x8A00;&#x8FDB;&#x5165;&#x901A;&#x9053;<code>c</code>,&#x7136;&#x540E;&#x628A;&#x5B83;&#x5199;&#x5165;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x3002;&#x6700;&#x540E;<code>snag-quotes</code>&#x521B;&#x5EFA;&#x4E86;<code>num-quotes</code>&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x540D;&#x8A00;&#xFF0C;&#x7136;&#x540E;&#x653E;&#x8FDB;&#x901A;&#x9053;<code>c</code>&#x3002;&#x5982;&#x679C;&#x4F60;&#x6C42;&#x503C;<code>(snag-quotes &quot;quotes&quot; 2)</code>,&#x5E76;&#x67E5;&#x770B;REPL&#x542F;&#x52A8;&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x6587;&#x4EF6;<em>quotes</em>,&#x5E94;&#x8BE5;&#x770B;&#x5230;&#x4E24;&#x4E2A;&#x540D;&#x8A00;:</p>
<figure class="highlight"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">=== BEGIN QUOTE ===</span><br><span class="line">Nobody&apos;s gonna believe that computers are intelligent until they start</span><br><span class="line">coming in late and lying about it.</span><br><span class="line">=== END QUOTE ===</span><br><span class="line"></span><br><span class="line">=== BEGIN QUOTE ===</span><br><span class="line">Give your child mental blocks for Christmas.</span><br><span class="line">=== END QUOTE ===</span><br></pre></td></tr></table></figure>
<blockquote>
<p>This kind of queuing differs from the example in Chapter 9. In that example, each task was handled in the order it was created. Here, each quote-retrieving task is handled in the order that it finishes. In both cases, you ensure that only one quote at a time is written to a file.</p>
</blockquote>
<p>&#x8FD9;&#x79CD;&#x961F;&#x5217;&#x4E0E;&#x7B2C;9&#x7AE0;&#x7684;&#x4E0D;&#x540C;&#x3002;&#x7B2C;9&#x7AE0;&#x7684;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x6309;&#x7167;&#x521B;&#x5EFA;&#x7684;&#x987A;&#x5E8F;&#x5904;&#x7406;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x6BCF;&#x4E2A;&#x83B7;&#x53D6;&#x540D;&#x8A00;&#x4EFB;&#x52A1;&#x6309;&#x7167;&#x5B83;&#x4EEC;&#x5B8C;&#x6210;&#x7684;&#x987A;&#x5E8F;&#x5904;&#x7406;&#x3002;&#x4E24;&#x8005;&#x90FD;&#x4FDD;&#x8BC1;&#x4E86;&#x4E00;&#x6B21;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x540D;&#x8A00;&#x5199;&#x5165;&#x6587;&#x4EF6;&#x3002;</p>
<blockquote>
<p>Escape Callback Hell with Process Pipelines</p>
</blockquote>
<h2 id="&#x7528;&#x8FC7;&#x7A0B;&#x7BA1;&#x9053;&#x907F;&#x514D;&#x56DE;&#x8C03;&#x5730;&#x72F1;"><a href="#&#x7528;&#x8FC7;&#x7A0B;&#x7BA1;&#x9053;&#x907F;&#x514D;&#x56DE;&#x8C03;&#x5730;&#x72F1;" class="headerlink" title="&#x7528;&#x8FC7;&#x7A0B;&#x7BA1;&#x9053;&#x907F;&#x514D;&#x56DE;&#x8C03;&#x5730;&#x72F1;"></a>&#x7528;&#x8FC7;&#x7A0B;&#x7BA1;&#x9053;&#x907F;&#x514D;&#x56DE;&#x8C03;&#x5730;&#x72F1;</h2><blockquote>
<p>In languages without channels, you need to express the idea &#x201C;when x happens, do y&#x201D; with <code>callbacks</code>. In a language like JavaScript, callbacks are a way to define code that executes asynchronously once other code finishes. If you&#x2019;ve worked with JavaScript, you&#x2019;ve probably spent some time wallowing in <em>callback hell</em>.</p>
</blockquote>
<p>&#x5728;&#x6CA1;&#x6709;&#x901A;&#x9053;&#x7684;&#x8BED;&#x8A00;&#x91CC;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x7528;<code>&#x56DE;&#x8C03;</code>&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x201D;&#x5F53;x&#x53D1;&#x751F;&#x65F6;&#x5019;&#xFF0C;&#x505A;y&#x201D;&#x3002;&#x5728;JavaScript&#x8FD9;&#x6837;&#x7684;&#x8BED;&#x8A00;&#x91CC;&#xFF0C;&#x56DE;&#x8C03;&#x662F;&#x5B9A;&#x4E49;&#x5F53;&#x5176;&#x4ED6;&#x4EE3;&#x7801;&#x5B8C;&#x6210;&#x65F6;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7528;&#x8FC7;JavaScript,&#x4F60;&#x53EF;&#x80FD;&#x5728;<em>&#x56DE;&#x8C03;&#x5730;&#x72F1;</em>&#x4E0A;&#x82B1;&#x8D39;&#x8FC7;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x3002;</p>
<blockquote>
<p>The reason it&#x2019;s called callback hell is that it&#x2019;s very easy to create dependencies among layers of callbacks that aren&#x2019;t immediately obvious. They end up sharing state, making it difficult to reason about the state of the overall system as the callbacks get triggered. You can avoid this depressing outcome by creating a process pipeline. That way, each unit of logic lives in its own isolated process, and all communication between units of logic occurs through explicitly defined input and output channels.</p>
</blockquote>
<p>&#x53EB;&#x505A;&#x56DE;&#x8C03;&#x5730;&#x72F1;&#x7684;&#x539F;&#x56E0;&#x662F;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x5EFA;&#x7ACB;&#x56DE;&#x8C03;&#x5C42;&#x4E4B;&#x95F4;&#x7684;&#x4E0D;&#x660E;&#x663E;&#x7684;&#x4F9D;&#x8D56;&#x3002;&#x6700;&#x540E;&#x5B83;&#x4EEC;&#x5171;&#x4EAB;&#x72B6;&#x6001;&#xFF0C;&#x4F7F;&#x56DE;&#x8C03;&#x89E6;&#x53D1;&#x65F6;&#xFF0C;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x884C;&#x4E3A;&#x5F88;&#x96BE;&#x5224;&#x65AD;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x521B;&#x5EFA;&#x8FC7;&#x7A0B;&#x7BA1;&#x9053;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x4EE4;&#x4EBA;&#x6CAE;&#x4E27;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x90A3;&#x6837;&#xFF0C;&#x6BCF;&#x4E2A;&#x903B;&#x8F91;&#x5355;&#x5143;&#x90FD;&#x5B58;&#x5728;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x9694;&#x79BB;&#x8FC7;&#x7A0B;&#x91CC;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x6240;&#x6709;&#x901A;&#x4FE1;&#x90FD;&#x901A;&#x8FC7;&#x660E;&#x786E;&#x5B9A;&#x4E49;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x901A;&#x9053;&#x5B8C;&#x6210;&#x3002;</p>
<blockquote>
<p>In the following example, we create three infinitely looping processes connected through channels, passing the out channel of one process as the in channel of the next process in the pipeline:</p>
</blockquote>
<p>&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x91CC;&#xFF0C;&#x521B;&#x5EFA;&#x4E86;&#x4E09;&#x4E2A;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x7684;&#xFF0C;&#x901A;&#x8FC7;&#x901A;&#x9053;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x628A;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x8F93;&#x51FA;&#x7684;&#x901A;&#x9053;&#xFF0C;&#x4F20;&#x9012;&#x7ED9;&#x4E0B;&#x4E2A;&#x8FC7;&#x7A0B;,&#x4F5C;&#x4E3A;&#x4E0B;&#x4E2A;&#x8FC7;&#x7A0B;&#x7684;&#x8F93;&#x5165;&#x901A;&#x9053;:</p>
<figure class="highlight clojure"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br></pre></td><td class="code"><pre><span class="line">(<span class="name"><span class="builtin-name">defn</span></span> upper-caser</span><br><span class="line">  [in]</span><br><span class="line">  (<span class="name"><span class="builtin-name">let</span></span> [out (<span class="name">chan</span>)]</span><br><span class="line">    (<span class="name">go</span> (<span class="name"><span class="builtin-name">while</span></span> <span class="literal">true</span> (<span class="name">&gt;!</span> out (<span class="name">clojure.string/upper-case</span> (<span class="name">&lt;!</span> in)))))</span><br><span class="line">    out))</span><br><span class="line"></span><br><span class="line">(<span class="name"><span class="builtin-name">defn</span></span> reverser</span><br><span class="line">  [in]</span><br><span class="line">  (<span class="name"><span class="builtin-name">let</span></span> [out (<span class="name">chan</span>)]</span><br><span class="line">    (<span class="name">go</span> (<span class="name"><span class="builtin-name">while</span></span> <span class="literal">true</span> (<span class="name">&gt;!</span> out (<span class="name">clojure.string/reverse</span> (<span class="name">&lt;!</span> in)))))</span><br><span class="line">    out))</span><br><span class="line"></span><br><span class="line">(<span class="name"><span class="builtin-name">defn</span></span> printer</span><br><span class="line">  [in]</span><br><span class="line">  (<span class="name">go</span> (<span class="name"><span class="builtin-name">while</span></span> <span class="literal">true</span> (<span class="name">println</span> (<span class="name">&lt;!</span> in)))))</span><br><span class="line"></span><br><span class="line">(<span class="name"><span class="builtin-name">def</span></span> in-chan (<span class="name">chan</span>))</span><br><span class="line">(<span class="name"><span class="builtin-name">def</span></span> upper-caser-out (<span class="name">upper-caser</span> in-chan))</span><br><span class="line">(<span class="name"><span class="builtin-name">def</span></span> reverser-out (<span class="name">reverser</span> upper-caser-out))</span><br><span class="line">(<span class="name">printer</span> reverser-out)</span><br><span class="line"></span><br><span class="line">(<span class="name">&gt;!!</span> in-chan <span class="string">&quot;redrum&quot;</span>)</span><br><span class="line"><span class="comment">; =&gt; MURDER</span></span><br><span class="line"></span><br><span class="line">(<span class="name">&gt;!!</span> in-chan <span class="string">&quot;repaid&quot;</span>)</span><br><span class="line"><span class="comment">; =&gt; DIAPER</span></span><br></pre></td></tr></table></figure>
<blockquote>
<p>By handling events using processes like this, it&#x2019;s easier to reason about the individual steps of the overall data transformation system. You can look at each step and understand what it does without having to refer to what might have happened before it or what might happen after it; each process is as easy to reason about as a pure function.</p>
</blockquote>
<p>&#x8FD9;&#x6837;&#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x5904;&#x7406;&#x4E8B;&#x4EF6;&#xFF0C;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x8F6C;&#x6362;&#x4E2D;&#x7684;&#x72EC;&#x7ACB;&#x6B65;&#x9AA4;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x6BCF;&#x6B65;&#x5E76;&#x7406;&#x89E3;&#x5B83;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x53C2;&#x8003;&#x8FD9;&#x6B65;&#x4E4B;&#x524D;&#x6216;&#x4E4B;&#x540E;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#xFF1B;&#x6BCF;&#x4E2A;&#x8FC7;&#x7A0B;&#x90FD;&#x8DDF;&#x4E00;&#x4E2A;&#x7EAF;&#x51FD;&#x6570;&#x4E00;&#x6837;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x3002;</p>
<blockquote>
<p>Additional Resources</p>
</blockquote>
<h2 id="&#x66F4;&#x591A;&#x8D44;&#x6E90;"><a href="#&#x66F4;&#x591A;&#x8D44;&#x6E90;" class="headerlink" title="&#x66F4;&#x591A;&#x8D44;&#x6E90;"></a>&#x66F4;&#x591A;&#x8D44;&#x6E90;</h2><blockquote>
<p>Clojure&#x2019;s core.async library was largely inspired by Go&#x2019;s concurrency model, which is based on the work by Tony Hoare in <em>Communicating Sequential Processes</em> and is available at <a href="http://www.usingcsp.com/" target="_blank" rel="external">http://www.usingcsp.com/</a>.</p>
</blockquote>
<p>Clojure&#x7684;core.async&#x5E93;&#x7684;&#x7075;&#x611F;&#x4E3B;&#x8981;&#x6765;&#x6E90;&#x4E0E;Go&#x7684;&#x5E76;&#x53D1;&#x6A21;&#x578B;&#xFF0C;&#x6B64;&#x6A21;&#x578B;&#x57FA;&#x4E8E;Tony Hoare&#x7684;&#x8457;&#x4F5C;<em>Communicating Sequential Processes</em>,&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x67E5;&#x770B; <a href="http://www.usingcsp.com/" target="_blank" rel="external">http://www.usingcsp.com/</a> &#x3002;</p>
<blockquote>
<p>Rob Pike, co-creator of Go, has a good talk on concurrency, which is available at <a href="https://www.youtube.com/watch?v=f6kdp27TYZs" target="_blank" rel="external">https://www.youtube.com/watch?v=f6kdp27TYZs</a>.</p>
</blockquote>
<p>Rob Pike,Go&#x7684;&#x5171;&#x540C;&#x521B;&#x9020;&#x8005;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x5E76;&#x53D1;&#x6F14;&#x8BB2;&#xFF0C;&#x5728;&#x8FD9;&#x91CC; <a href="https://www.youtube.com/watch?v=f6kdp27TYZs" target="_blank" rel="external">https://www.youtube.com/watch?v=f6kdp27TYZs</a> &#x3002;</p>
<blockquote>
<p>ClojureScript, also known as the best thing to happen to the browser, uses core.async. No more callback hell! You can learn about ClojureScript at <a href="https://github.com/clojure/clojurescript" target="_blank" rel="external">https://github.com/clojure/clojurescript</a>.</p>
</blockquote>
<p>ClojureScript, &#x88AB;&#x79F0;&#x4E3A;&#xFF1A;&#x5BF9;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#x6765;&#x8BF4;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x4E8B;&#x53D1;&#x751F;&#x4E86;&#x3002;ClojureScript&#x4F7F;&#x7528;&#x4E86;core.async&#x3002;&#x4E0D;&#x5728;&#x6709;&#x56DE;&#x8C03;&#x5730;&#x72F1;&#x4E86;&#xFF01;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x5B66;&#x4E60;ClojureScript: <a href="https://github.com/clojure/clojurescript" target="_blank" rel="external">https://github.com/clojure/clojurescript</a> &#x3002;</p>
<blockquote>
<p>Finally, check out the API docs at <a href="http://clojure.github.io/core.async/" target="_blank" rel="external">http://clojure.github.io/core.async/</a>.</p>
</blockquote>
<p>&#x6700;&#x540E;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;core.async&#x7684;API&#x6587;&#x6863; <a href="http://clojure.github.io/core.async/" target="_blank" rel="external">http://clojure.github.io/core.async/</a> &#x3002;</p>
<blockquote>
<p>Summary</p>
</blockquote>
<h2 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h2><blockquote>
<p>In this chapter, you learned about how core.async allows you to create concurrent processes that respond to the put and take communication events on channels. You learned about how to use <code>go</code> and <code>thread</code> to create concurrent processes that wait for communication events by parking and blocking. You also learned how to create process pipelines by making the out channel of one process the in channel of another, and how this allows you to write code that&#x2019;s way more intelligible than nested callbacks. Finally, you meditated on whether or not you&#x2019;re just a fancy hot dog vending machine.</p>
</blockquote>
<p>&#x8FD9;&#x7AE0;&#x77E5;&#x9053;&#x4E86;core.async&#x5141;&#x8BB8;&#x521B;&#x5EFA;&#x5E76;&#x53D1;&#x8FC7;&#x7A0B;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x4F1A;&#x5BF9;&#x901A;&#x9053;&#x4E0A;&#x7684;&#x653E;&#x8FDB;&#x548C;&#x53D6;&#x5F97;&#x8FD9;&#x4E24;&#x79CD;&#x901A;&#x4FE1;&#x4E8B;&#x4EF6;&#x505A;&#x51FA;&#x54CD;&#x5E94;&#x3002;&#x5B66;&#x4E60;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528;<code>go</code>&#x548C;<code>thread</code>&#x521B;&#x5EFA;&#x5E76;&#x53D1;&#x7684;&#x7B49;&#x5F85;&#x5E76;&#x53D1;&#x4E8B;&#x4EF6;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;<code>go</code>&#x91CC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x505C;&#x6CCA;&#x65B9;&#x5F0F;&#xFF0C;<code>thread</code>&#x4F7F;&#x7528;&#x7684;&#x662F;&#x963B;&#x585E;&#x65B9;&#x5F0F;&#x3002;&#x8FD8;&#x5B66;&#x4E60;&#x4E86;&#x521B;&#x5EFA;&#x8FC7;&#x7A0B;&#x7BA1;&#x9053;&#xFF0C;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x7684;&#x8F93;&#x51FA;&#x901A;&#x9053;&#x4F5C;&#x4E3A;&#x53E6;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x7684;&#x8F93;&#x5165;&#x901A;&#x9053;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x4EE3;&#x7801;&#x6BD4;&#x56DE;&#x8C03;&#x5D4C;&#x5957;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x4F60;&#x8FD8;&#x5C31;&#x4F60;&#x662F;&#x5426;&#x53EA;&#x662F;&#x4E2A;&#x5176;&#x5999;&#x7684;&#x70ED;&#x72D7;&#x8D29;&#x5356;&#x673A;&#x8FDB;&#x884C;&#x4E86;&#x6DF1;&#x5165;&#x601D;&#x8003;&#x3002;</p>
<hr>
<p>&#x8BD1;&#x6587;&#x7ED3;&#x675F;&#x3002;</p>

      
    </div>

    <div>
      
        
      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/Clojure/" rel="tag">#Clojure</a>
          
            <a href="/tags/Clojure-For-The-Branve-And-True/" rel="tag">#Clojure For The Branve And True</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/07/29/brave-clojure-organization/" rel="next" title="【译】Brave Clojure 第六章:组织项目:图书管理员传奇">
                <i class="fa fa-chevron-left"></i> 【译】Brave Clojure 第六章:组织项目:图书管理员传奇
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/08/20/brave-clojure-java/" rel="prev" title="【译】Brave Clojure 第十二章:与JVM共事">
                【译】Brave Clojure 第十二章:与JVM共事 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <div class="ds-share flat" data-thread-key="2016/08/02/brave-clojure-core-async/"
     data-title="【译】Brave Clojure 第十一章:用core.async掌握并发过程"
     data-content=""
     data-url="http://yoursite.com/2016/08/02/brave-clojure-core-async/">
  <div class="ds-share-inline">
    <ul  class="ds-share-icons-16">

      <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
      <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
      <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
      <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>
      <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>

    </ul>
    <div class="ds-share-icons-more">
    </div>
  </div>
</div>
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/08/02/brave-clojure-core-async/"
           data-title="【译】Brave Clojure 第十一章:用core.async掌握并发过程" data-url="http://yoursite.com/2016/08/02/brave-clojure-core-async/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="https://s.gravatar.com/avatar/954a8b1f4c32dbb5a11399ae5e236a5f?s=80"
               alt="胡军" />
          <p class="site-author-name" itemprop="name">胡军</p>
          <p class="site-description motion-element" itemprop="description">学习是一种生活方式</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">23</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">7</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/morrxy" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://twitter.com/morrxy" target="_blank">
                  
                    <i class="fa fa-twitter"></i> Twitter
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#从过程开始"><span class="nav-number">1.</span> <span class="nav-text">从过程开始</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#缓冲"><span class="nav-number">1.1.</span> <span class="nav-text">缓冲</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#阻塞与停泊"><span class="nav-number">1.2.</span> <span class="nav-text">阻塞与停泊</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#thread"><span class="nav-number">1.3.</span> <span class="nav-text">thread</span></a></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#你渴望的热狗机"><span class="nav-number">2.</span> <span class="nav-text">你渴望的热狗机</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#alts"><span class="nav-number">3.</span> <span class="nav-text">alts!!</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#队列"><span class="nav-number">4.</span> <span class="nav-text">队列</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#用过程管道避免回调地狱"><span class="nav-number">5.</span> <span class="nav-text">用过程管道避免回调地狱</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#更多资源"><span class="nav-number">6.</span> <span class="nav-text">更多资源</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#总结"><span class="nav-number">7.</span> <span class="nav-text">总结</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">胡军</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  


  




<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>


  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.scheme !== 'Pisces' && (CONFIG.sidebar.display === 'post' || CONFIG.sidebar.display === 'always')) {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"morrxy"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  





  
  
  

  


</body>
</html>
